betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Include/apm32f4xx_ddl_rtc.h
                            This feature can be modified afterwards using unitary function @ref DDL_RTC_TIME_SetHour(). */

  uint8_t Minutes;     /*!< Specifies the RTC Time Minutes.
                            This parameter must be a number between Min_Data = 0 and Max_Data = 59

                            This feature can be modified afterwards using unitary function @ref DDL_RTC_TIME_SetMinute(). */

  uint8_t Seconds;     /*!< Specifies the RTC Time Seconds.
                            This parameter must be a number between Min_Data = 0 and Max_Data = 59

                            This feature can be modified afterwards using unitary function @ref DDL_RTC_TIME_SetSecond(). */
} DDL_RTC_TimeTypeDef;

#if defined (RTC_DATE_YRT)
/**
  * @brief  RTC Date structure definition
  */
typedef struct
{
  uint8_t WeekDay;  /*!< Specifies the RTC Date WeekDay.
                         This parameter can be a value of @ref RTC_DDL_EC_WEEKDAY

                         This feature can be modified afterwards using unitary function @ref DDL_RTC_DATE_SetWeekDay(). */

  uint8_t Month;    /*!< Specifies the RTC Date Month.
                         This parameter can be a value of @ref RTC_DDL_EC_MONTH

                         This feature can be modified afterwards using unitary function @ref DDL_RTC_DATE_SetMonth(). */

  uint8_t Day;      /*!< Specifies the RTC Date Day.
                         This parameter must be a number between Min_Data = 1 and Max_Data = 31

                         This feature can be modified afterwards using unitary function @ref DDL_RTC_DATE_SetDay(). */

  uint8_t Year;     /*!< Specifies the RTC Date Year.
                         This parameter must be a number between Min_Data = 0 and Max_Data = 99

                         This feature can be modified afterwards using unitary function @ref DDL_RTC_DATE_SetYear(). */
} DDL_RTC_DateTypeDef;

#endif /* RTC_DATE_YRT */

/**
  * @brief  RTC Alarm structure definition
  */
typedef struct
{
  DDL_RTC_TimeTypeDef AlarmTime;  /*!< Specifies the RTC Alarm Time members. */

#if defined (RTC_ALRMA_DATEMEN)
  uint32_t AlarmMask;            /*!< Specifies the RTC Alarm Masks.
                                      This parameter can be a value of @ref RTC_DDL_EC_ALMA_MASK for ALARM A or @ref RTC_DDL_EC_ALMB_MASK for ALARM B.

                                      This feature can be modified afterwards using unitary function @ref DDL_RTC_ALMA_SetMask() for ALARM A
                                      or @ref DDL_RTC_ALMB_SetMask() for ALARM B.
                                 */

  uint32_t AlarmDateWeekDaySel;  /*!< Specifies the RTC Alarm is on day or WeekDay.
                                      This parameter can be a value of @ref RTC_DDL_EC_ALMA_WEEKDAY_SELECTION for ALARM A or @ref RTC_DDL_EC_ALMB_WEEKDAY_SELECTION for ALARM B

                                      This feature can be modified afterwards using unitary function @ref DDL_RTC_ALMA_EnableWeekday() or @ref DDL_RTC_ALMA_DisableWeekday()
                                      for ALARM A or @ref DDL_RTC_ALMB_EnableWeekday() or @ref DDL_RTC_ALMB_DisableWeekday() for ALARM B
                                 */

  uint8_t AlarmDateWeekDay;      /*!< Specifies the RTC Alarm Day/WeekDay.
                                      If AlarmDateWeekDaySel set to day, this parameter  must be a number between Min_Data = 1 and Max_Data = 31.

                                      This feature can be modified afterwards using unitary function @ref DDL_RTC_ALMA_SetDay()
                                      for ALARM A or @ref DDL_RTC_ALMB_SetDay() for ALARM B.

                                      If AlarmDateWeekDaySel set to Weekday, this parameter can be a value of @ref RTC_DDL_EC_WEEKDAY.

                                      This feature can be modified afterwards using unitary function @ref DDL_RTC_ALMA_SetWeekDay()
                                      for ALARM A or @ref DDL_RTC_ALMB_SetWeekDay() for ALARM B.
                                 */
#endif /* RTC_ALRMA_DATEMEN */
} DDL_RTC_AlarmTypeDef;

/**
  * @}
  */
#endif /* USE_FULL_DDL_DRIVER */

/* Exported constants --------------------------------------------------------*/
/** @defgroup RTC_DDL_Exported_Constants RTC Exported Constants
  * @{
  */

#if defined(USE_FULL_DDL_DRIVER)
/** @defgroup RTC_DDL_EC_FORMAT FORMAT
  * @{
  */
#define DDL_RTC_FORMAT_BIN                  0x00000000U /*!< Binary data format */
#define DDL_RTC_FORMAT_BCD                  0x00000001U /*!< BCD data format */
/**
  * @}
  */

#endif /* USE_FULL_DDL_DRIVER */

/** @defgroup RTC_DDL_EC_GET_FLAG Get Flags Defines
  * @brief    Flags defines which can be used with DDL_RTC_ReadReg function
  * @{
  */
#define DDL_RTC_STS_RCALPFLG                  RTC_STS_RCALPFLG
#if defined(RTC_TAMPER2_SUPPORT)
#define DDL_RTC_STS_TP2FLG                    RTC_STS_TP2FLG
#endif /* RTC_TAMPER2_SUPPORT */
#define DDL_RTC_STS_TP1FLG                    RTC_STS_TP1FLG
#define DDL_RTC_STS_TSOVRFLG                  RTC_STS_TSOVRFLG
#define DDL_RTC_STS_TSFLG                     RTC_STS_TSFLG
#define DDL_RTC_STS_WUTFLG                    RTC_STS_WUTFLG
#define DDL_RTC_STS_ALRBFLG                   RTC_STS_ALRBFLG
#define DDL_RTC_STS_ALRAFLG                   RTC_STS_ALRAFLG
#define DDL_RTC_STS_RINITFLG                  RTC_STS_RINITFLG
#define DDL_RTC_STS_RSFLG                     RTC_STS_RSFLG
#define DDL_RTC_STS_INITSFLG                  RTC_STS_INITSFLG
#define DDL_RTC_STS_SOPFLG                    RTC_STS_SOPFLG
#define DDL_RTC_STS_WUTWFLG                   RTC_STS_WUTWFLG
#define DDL_RTC_STS_ALRBWFLG                  RTC_STS_ALRBWFLG
#define DDL_RTC_STS_ALRAWFLG                  RTC_STS_ALRAWFLG
/**
  * @}
  */

/** @defgroup RTC_DDL_EC_IT IT Defines
  * @brief    IT defines which can be used with DDL_RTC_ReadReg and  DDL_RTC_WriteReg functions
  * @{
  */
#define DDL_RTC_CTRL_TSIEN                     RTC_CTRL_TSIEN
#define DDL_RTC_CTRL_WUTIEN                    RTC_CTRL_WUTIEN
#define DDL_RTC_CTRL_ALRBIEN                   RTC_CTRL_ALRBIEN
#define DDL_RTC_CTRL_ALRAIEN                   RTC_CTRL_ALRAIEN
#define DDL_RTC_TACFG_TPIEN                    RTC_TACFG_TPIEN
/**
  * @}
  */

/** @defgroup RTC_DDL_EC_WEEKDAY  WEEK DAY
  * @{
  */
#define DDL_RTC_WEEKDAY_MONDAY              ((uint8_t)0x01U) /*!< Monday    */
#define DDL_RTC_WEEKDAY_TUESDAY             ((uint8_t)0x02U) /*!< Tuesday   */
#define DDL_RTC_WEEKDAY_WEDNESDAY           ((uint8_t)0x03U) /*!< Wednesday */
#define DDL_RTC_WEEKDAY_THURSDAY            ((uint8_t)0x04U) /*!< Thrusday  */
#define DDL_RTC_WEEKDAY_FRIDAY              ((uint8_t)0x05U) /*!< Friday    */
#define DDL_RTC_WEEKDAY_SATURDAY            ((uint8_t)0x06U) /*!< Saturday  */
#define DDL_RTC_WEEKDAY_SUNDAY              ((uint8_t)0x07U) /*!< Sunday    */
/**
  * @}
  */

/** @defgroup RTC_DDL_EC_MONTH  MONTH
  * @{
  */
#define DDL_RTC_MONTH_JANUARY               ((uint8_t)0x01U)  /*!< January   */
#define DDL_RTC_MONTH_FEBRUARY              ((uint8_t)0x02U)  /*!< February  */
#define DDL_RTC_MONTH_MARCH                 ((uint8_t)0x03U)  /*!< March     */
#define DDL_RTC_MONTH_APRIL                 ((uint8_t)0x04U)  /*!< April     */
#define DDL_RTC_MONTH_MAY                   ((uint8_t)0x05U)  /*!< May       */
#define DDL_RTC_MONTH_JUNE                  ((uint8_t)0x06U)  /*!< June      */
#define DDL_RTC_MONTH_JULY                  ((uint8_t)0x07U)  /*!< July      */
#define DDL_RTC_MONTH_AUGUST                ((uint8_t)0x08U)  /*!< August    */
#define DDL_RTC_MONTH_SEPTEMBER             ((uint8_t)0x09U)  /*!< September */
#define DDL_RTC_MONTH_OCTOBER               ((uint8_t)0x10U)  /*!< October   */
#define DDL_RTC_MONTH_NOVEMBER              ((uint8_t)0x11U)  /*!< November  */
#define DDL_RTC_MONTH_DECEMBER              ((uint8_t)0x12U)  /*!< December  */
/**
  * @}
  */

