betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Include/apm32f4xx_ddl_rtc.h
/** @defgroup RTC_DDL_EC_HOURFORMAT  HOUR FORMAT
  * @{
  */
#define DDL_RTC_HOURFORMAT_24HOUR           0x00000000U           /*!< 24 hour/day format */
#define DDL_RTC_HOURFORMAT_AMPM             RTC_CTRL_TIMEFCFG            /*!< AM/PM hour format */
/**
  * @}
  */

/** @defgroup RTC_DDL_EC_ALARMOUT  ALARM OUTPUT
  * @{
  */
#define DDL_RTC_ALARMOUT_DISABLE            0x00000000U             /*!< Output disabled */
#define DDL_RTC_ALARMOUT_ALMA               RTC_CTRL_OUTSEL_0           /*!< Alarm A output enabled */
#define DDL_RTC_ALARMOUT_ALMB               RTC_CTRL_OUTSEL_1           /*!< Alarm B output enabled */
#define DDL_RTC_ALARMOUT_WAKEUP             RTC_CTRL_OUTSEL             /*!< Wakeup output enabled */
/**
  * @}
  */

/** @defgroup RTC_DDL_EC_ALARM_OUTPUTTYPE  ALARM OUTPUT TYPE
  * @{
  */
#define DDL_RTC_ALARM_OUTPUTTYPE_OPENDRAIN  0x00000000U                          /*!< RTC_ALARM, when mapped on PC13, is open-drain output */
#define DDL_RTC_ALARM_OUTPUTTYPE_PUSHPULL   RTC_TACFG_ALRMOT /*!< RTC_ALARM, when mapped on PC13, is push-pull output */
/**
  * @}
  */

/** @defgroup RTC_DDL_EC_OUTPUTPOLARITY_PIN  OUTPUT POLARITY PIN
  * @{
  */
#define DDL_RTC_OUTPUTPOLARITY_PIN_HIGH     0x00000000U           /*!< Pin is high when ALRAF/ALRBF/WUTF is asserted (depending on OSEL)*/
#define DDL_RTC_OUTPUTPOLARITY_PIN_LOW      RTC_CTRL_POLCFG            /*!< Pin is low when ALRAF/ALRBF/WUTF is asserted (depending on OSEL) */
/**
  * @}
  */

/** @defgroup RTC_DDL_EC_TIME_FORMAT TIME FORMAT
  * @{
  */
#define DDL_RTC_TIME_FORMAT_AM_OR_24        0x00000000U           /*!< AM or 24-hour format */
#define DDL_RTC_TIME_FORMAT_PM              RTC_TIME_TIMEFCFG             /*!< PM */
/**
  * @}
  */

/** @defgroup RTC_DDL_EC_SHIFT_SECOND  SHIFT SECOND
  * @{
  */
#define DDL_RTC_SHIFT_SECOND_DELAY          0x00000000U           /* Delay (seconds) = SUBFS / (PREDIV_S + 1) */
#define DDL_RTC_SHIFT_SECOND_ADVANCE        RTC_SHIFT_ADD1SECEN      /* Advance (seconds) = (1 - (SUBFS / (PREDIV_S + 1))) */
/**
  * @}
  */

/** @defgroup RTC_DDL_EC_ALMA_MASK  ALARMA MASK
  * @{
  */
#define DDL_RTC_ALMA_MASK_NONE              0x00000000U             /*!< No masks applied on Alarm A*/
#define DDL_RTC_ALMA_MASK_DATEWEEKDAY       RTC_ALRMA_DATEMEN         /*!< Date/day do not care in Alarm A comparison */
#define DDL_RTC_ALMA_MASK_HOURS             RTC_ALRMA_HRMEN         /*!< Hours do not care in Alarm A comparison */
#define DDL_RTC_ALMA_MASK_MINUTES           RTC_ALRMA_MINMEN         /*!< Minutes do not care in Alarm A comparison */
#define DDL_RTC_ALMA_MASK_SECONDS           RTC_ALRMA_SECMEN         /*!< Seconds do not care in Alarm A comparison */
#define DDL_RTC_ALMA_MASK_ALL               (RTC_ALRMA_DATEMEN | RTC_ALRMA_HRMEN | RTC_ALRMA_MINMEN | RTC_ALRMA_SECMEN) /*!< Masks all */
/**
  * @}
  */

/** @defgroup RTC_DDL_EC_ALMA_TIME_FORMAT  ALARMA TIME FORMAT
  * @{
  */
#define DDL_RTC_ALMA_TIME_FORMAT_AM         0x00000000U           /*!< AM or 24-hour format */
#define DDL_RTC_ALMA_TIME_FORMAT_PM         RTC_ALRMA_TIMEFCFG         /*!< PM */
/**
  * @}
  */

/** @defgroup RTC_DDL_EC_ALMA_WEEKDAY_SELECTION RTC Alarm A Date WeekDay
  * @{
  */
#define DDL_RTC_ALMA_DATEWEEKDAYSEL_DATE    0x00000000U             /*!< Alarm A Date is selected */
#define DDL_RTC_ALMA_DATEWEEKDAYSEL_WEEKDAY RTC_ALRMA_WEEKSEL        /*!< Alarm A WeekDay is selected */
/**
  * @}
  */

/** @defgroup RTC_DDL_EC_ALMB_MASK  ALARMB MASK
  * @{
  */
#define DDL_RTC_ALMB_MASK_NONE              0x00000000U             /*!< No masks applied on Alarm B                */
#define DDL_RTC_ALMB_MASK_DATEWEEKDAY       RTC_ALRMB_DATEMEN         /*!< Date/day do not care in Alarm B comparison */
#define DDL_RTC_ALMB_MASK_HOURS             RTC_ALRMB_HRMEN         /*!< Hours do not care in Alarm B comparison    */
#define DDL_RTC_ALMB_MASK_MINUTES           RTC_ALRMB_MINMEN         /*!< Minutes do not care in Alarm B comparison  */
#define DDL_RTC_ALMB_MASK_SECONDS           RTC_ALRMB_SECMEN         /*!< Seconds do not care in Alarm B comparison  */
#define DDL_RTC_ALMB_MASK_ALL               (RTC_ALRMB_DATEMEN | RTC_ALRMB_HRMEN | RTC_ALRMB_MINMEN | RTC_ALRMB_SECMEN) /*!< Masks all */
/**
  * @}
  */

/** @defgroup RTC_DDL_EC_ALMB_TIME_FORMAT  ALARMB TIME FORMAT
  * @{
  */
#define DDL_RTC_ALMB_TIME_FORMAT_AM         0x00000000U           /*!< AM or 24-hour format */
#define DDL_RTC_ALMB_TIME_FORMAT_PM         RTC_ALRMB_TIMEFCFG         /*!< PM */
/**
  * @}
  */

/** @defgroup RTC_DDL_EC_ALMB_WEEKDAY_SELECTION RTC Alarm B Date WeekDay
  * @{
  */
#define DDL_RTC_ALMB_DATEWEEKDAYSEL_DATE    0x00000000U             /*!< Alarm B Date is selected */
#define DDL_RTC_ALMB_DATEWEEKDAYSEL_WEEKDAY RTC_ALRMB_WEEKSEL        /*!< Alarm B WeekDay is selected */
/**
  * @}
  */

/** @defgroup RTC_DDL_EC_TIMESTAMP_EDGE  TIMESTAMP EDGE
  * @{
  */
#define DDL_RTC_TIMESTAMP_EDGE_RISING       0x00000000U           /*!< RTC_TS input rising edge generates a time-stamp event */
#define DDL_RTC_TIMESTAMP_EDGE_FALLING      RTC_CTRL_TSETECFG         /*!< RTC_TS input falling edge generates a time-stamp even */
/**
  * @}
  */

/** @defgroup RTC_DDL_EC_TS_TIME_FORMAT  TIMESTAMP TIME FORMAT
  * @{
  */
#define DDL_RTC_TS_TIME_FORMAT_AM           0x00000000U           /*!< AM or 24-hour format */
#define DDL_RTC_TS_TIME_FORMAT_PM           RTC_TSTIME_TIMEFCFG           /*!< PM */
/**
  * @}
  */

/** @defgroup RTC_DDL_EC_TAMPER  TAMPER
  * @{
  */
#define DDL_RTC_TAMPER_1                    RTC_TACFG_TP1EN /*!< RTC_TAMP1 input detection */
#if defined(RTC_TAMPER2_SUPPORT)
#define DDL_RTC_TAMPER_2                    RTC_TACFG_TP2EN /*!< RTC_TAMP2 input detection */
#endif /* RTC_TAMPER2_SUPPORT */
/**
  * @}
  */

/** @defgroup RTC_DDL_EC_TAMPER_DURATION  TAMPER DURATION
  * @{
  */
#define DDL_RTC_TAMPER_DURATION_1RTCCLK     0x00000000U                             /*!< Tamper pins are pre-charged before sampling during 1 RTCCLK cycle  */
#define DDL_RTC_TAMPER_DURATION_2RTCCLK     RTC_TACFG_TPPRDUSEL_0  /*!< Tamper pins are pre-charged before sampling during 2 RTCCLK cycles */
#define DDL_RTC_TAMPER_DURATION_4RTCCLK     RTC_TACFG_TPPRDUSEL_1  /*!< Tamper pins are pre-charged before sampling during 4 RTCCLK cycles */
#define DDL_RTC_TAMPER_DURATION_8RTCCLK     RTC_TACFG_TPPRDUSEL    /*!< Tamper pins are pre-charged before sampling during 8 RTCCLK cycles */
/**
  * @}
  */

/** @defgroup RTC_DDL_EC_TAMPER_FILTER  TAMPER FILTER
  * @{
  */
#define DDL_RTC_TAMPER_FILTER_DISABLE       0x00000000U                              /*!< Tamper filter is disabled */
#define DDL_RTC_TAMPER_FILTER_2SAMPLE       RTC_TACFG_TPFCSEL_0    /*!< Tamper is activated after 2 consecutive samples at the active level */
#define DDL_RTC_TAMPER_FILTER_4SAMPLE       RTC_TACFG_TPFCSEL_1    /*!< Tamper is activated after 4 consecutive samples at the active level */
#define DDL_RTC_TAMPER_FILTER_8SAMPLE       RTC_TACFG_TPFCSEL      /*!< Tamper is activated after 8 consecutive samples at the active level. */
/**
  * @}
  */

/** @defgroup RTC_DDL_EC_TAMPER_SAMPLFREQDIV  TAMPER SAMPLING FREQUENCY DIVIDER
  * @{
  */
#define DDL_RTC_TAMPER_SAMPLFREQDIV_32768   0x00000000U                                                      /*!< Each of the tamper inputs are sampled with a frequency =  RTCCLK / 32768 */
#define DDL_RTC_TAMPER_SAMPLFREQDIV_16384   RTC_TACFG_TPSFSEL_0                           /*!< Each of the tamper inputs are sampled with a frequency =  RTCCLK / 16384 */
#define DDL_RTC_TAMPER_SAMPLFREQDIV_8192    RTC_TACFG_TPSFSEL_1                           /*!< Each of the tamper inputs are sampled with a frequency =  RTCCLK / 8192 */
#define DDL_RTC_TAMPER_SAMPLFREQDIV_4096    (RTC_TACFG_TPSFSEL_1 | RTC_TACFG_TPSFSEL_0) /*!< Each of the tamper inputs are sampled with a frequency =  RTCCLK / 4096 */
#define DDL_RTC_TAMPER_SAMPLFREQDIV_2048    RTC_TACFG_TPSFSEL_2                           /*!< Each of the tamper inputs are sampled with a frequency =  RTCCLK / 2048 */
#define DDL_RTC_TAMPER_SAMPLFREQDIV_1024    (RTC_TACFG_TPSFSEL_2 | RTC_TACFG_TPSFSEL_0) /*!< Each of the tamper inputs are sampled with a frequency =  RTCCLK / 1024 */
#define DDL_RTC_TAMPER_SAMPLFREQDIV_512     (RTC_TACFG_TPSFSEL_2 | RTC_TACFG_TPSFSEL_1) /*!< Each of the tamper inputs are sampled with a frequency =  RTCCLK / 512 */
#define DDL_RTC_TAMPER_SAMPLFREQDIV_256     RTC_TACFG_TPSFSEL                             /*!< Each of the tamper inputs are sampled with a frequency =  RTCCLK / 256 */
/**
  * @}
  */

