betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Include/apm32f4xx_ddl_rtc.h
/** @defgroup RTC_DDL_EC_TAMPER_ACTIVELEVEL  TAMPER ACTIVE LEVEL
  * @{
  */
#define DDL_RTC_TAMPER_ACTIVELEVEL_TAMP1    RTC_TACFG_TP1ALCFG /*!< RTC_TAMP1 input falling edge (if TAMPFLT = 00) or staying high (if TAMPFLT != 00) triggers a tamper detection event */
#if defined(RTC_TAMPER2_SUPPORT)
#define DDL_RTC_TAMPER_ACTIVELEVEL_TAMP2    RTC_TACFG_TP2ALCFG /*!< RTC_TAMP2 input falling edge (if TAMPFLT = 00) or staying high (if TAMPFLT != 00) triggers a tamper detection event */
#endif /* RTC_TAMPER2_SUPPORT */
#if defined (BAKPR)
#define DDL_RTC_TAMPER_ACTIVELEVEL_LOW          BAKPR_CTRL_TPALCFG     /*!< A high level on the TAMPER pin resets all data backup registers (if TPE bit is set) */
#define DDL_RTC_TAMPER_ACTIVELEVEL_HIGH         (0x00000000U)          /*!< A low level on the TAMPER pin resets all data backup registers (if TPE bit is set) */
#endif /* BAKPR */
/**
  * @}
  */

/** @defgroup RTC_DDL_EC_WAKEUPCLOCK_DIV  WAKEUP CLOCK DIV
  * @{
  */
#define DDL_RTC_WAKEUPCLOCK_DIV_16          0x00000000U                           /*!< RTC/16 clock is selected */
#define DDL_RTC_WAKEUPCLOCK_DIV_8           (RTC_CTRL_WUCLKSEL_0)                    /*!< RTC/8 clock is selected */
#define DDL_RTC_WAKEUPCLOCK_DIV_4           (RTC_CTRL_WUCLKSEL_1)                    /*!< RTC/4 clock is selected */
#define DDL_RTC_WAKEUPCLOCK_DIV_2           (RTC_CTRL_WUCLKSEL_1 | RTC_CTRL_WUCLKSEL_0) /*!< RTC/2 clock is selected */
#define DDL_RTC_WAKEUPCLOCK_CKSPRE          (RTC_CTRL_WUCLKSEL_2)                    /*!< ck_spre (usually 1 Hz) clock is selected */
#define DDL_RTC_WAKEUPCLOCK_CKSPRE_WUT      (RTC_CTRL_WUCLKSEL_2 | RTC_CTRL_WUCLKSEL_1) /*!< ck_spre (usually 1 Hz) clock is selected and 2exp16 is added to the WUT counter value*/
/**
  * @}
  */

/** @defgroup RTC_DDL_EC_BKP  BACKUP
  * @{
  */
#define DDL_RTC_BKP_DR0                     0x00000000U
#define DDL_RTC_BKP_DR1                     0x00000001U
#define DDL_RTC_BKP_DR2                     0x00000002U
#define DDL_RTC_BKP_DR3                     0x00000003U
#define DDL_RTC_BKP_DR4                     0x00000004U
#define DDL_RTC_BKP_DR5                     0x00000005U
#define DDL_RTC_BKP_DR6                     0x00000006U
#define DDL_RTC_BKP_DR7                     0x00000007U
#define DDL_RTC_BKP_DR8                     0x00000008U
#define DDL_RTC_BKP_DR9                     0x00000009U
#define DDL_RTC_BKP_DR10                    0x0000000AU
#if defined (BAKPR)
#define DDL_RTC_BKP_DR11                    0x00000010U
#define DDL_RTC_BKP_DR12                    0x00000011U
#define DDL_RTC_BKP_DR13                    0x00000012U
#define DDL_RTC_BKP_DR14                    0x00000013U
#define DDL_RTC_BKP_DR15                    0x00000014U
#define DDL_RTC_BKP_DR16                    0x00000015U
#define DDL_RTC_BKP_DR17                    0x00000016U
#define DDL_RTC_BKP_DR18                    0x00000017U
#define DDL_RTC_BKP_DR19                    0x00000018U
#else
#define DDL_RTC_BKP_DR11                    0x0000000BU
#define DDL_RTC_BKP_DR12                    0x0000000CU
#define DDL_RTC_BKP_DR13                    0x0000000DU
#define DDL_RTC_BKP_DR14                    0x0000000EU
#define DDL_RTC_BKP_DR15                    0x0000000FU
#define DDL_RTC_BKP_DR16                    0x00000010U
#define DDL_RTC_BKP_DR17                    0x00000011U
#define DDL_RTC_BKP_DR18                    0x00000012U
#define DDL_RTC_BKP_DR19                    0x00000013U
#endif /*BAKPR*/
#define DDL_RTC_BKP_DR20                    0x00000019U
#define DDL_RTC_BKP_DR21                    0x0000001AU
#define DDL_RTC_BKP_DR22                    0x0000001BU
#define DDL_RTC_BKP_DR23                    0x0000001CU
#define DDL_RTC_BKP_DR24                    0x0000001DU
#define DDL_RTC_BKP_DR25                    0x0000001EU
#define DDL_RTC_BKP_DR26                    0x0000001FU
#define DDL_RTC_BKP_DR27                    0x00000020U
#define DDL_RTC_BKP_DR28                    0x00000021U
#define DDL_RTC_BKP_DR29                    0x00000022U
#define DDL_RTC_BKP_DR30                    0x00000023U
#define DDL_RTC_BKP_DR31                    0x00000024U
#define DDL_RTC_BKP_DR32                    0x00000025U
#define DDL_RTC_BKP_DR33                    0x00000026U
#define DDL_RTC_BKP_DR34                    0x00000027U
#define DDL_RTC_BKP_DR35                    0x00000028U
#define DDL_RTC_BKP_DR36                    0x00000029U
#define DDL_RTC_BKP_DR37                    0x0000002AU
#define DDL_RTC_BKP_DR38                    0x0000002BU
#define DDL_RTC_BKP_DR39                    0x0000002CU
#define DDL_RTC_BKP_DR40                    0x0000002DU
#define DDL_RTC_BKP_DR41                    0x0000002EU
#define DDL_RTC_BKP_DR42                    0x0000002FU
/**
  * @}
  */
#if defined (BAKPR)
/** @defgroup DDL_RTC_Output_Source         Clock Source to output on the Tamper Pin
  * @{
  */
#define DDL_RTC_CALIB_OUTPUT_NONE           (0x00000000U)                                  /*!< Calibration output disabled */
#define DDL_RTC_CALIB_OUTPUT_RTCCLOCK       BAKPR_CLKCAL_CALCOEN                           /*!< Calibration output is RTC Clock with a frequency divided by 64 on the TAMPER Pin */
#define DDL_RTC_CALIB_OUTPUT_ALARM          BAKPR_CLKCAL_ASPOEN                            /*!< Calibration output is Alarm pulse signal on the TAMPER pin */
#define DDL_RTC_CALIB_OUTPUT_SECOND        (BAKPR_CLKCAL_ASPOEN | BAKPR_CLKCAL_ASPOSEL)    /*!< Calibration output is Second pulse signal on the TAMPER pin*/
/**
  * @}
  */
#else
/** @defgroup RTC_DDL_EC_CALIB_OUTPUT  Calibration output
  * @{
  */
#define DDL_RTC_CALIB_OUTPUT_NONE           0x00000000U                           /*!< Calibration output disabled */
#define DDL_RTC_CALIB_OUTPUT_1HZ            (RTC_CTRL_CALOEN | RTC_CTRL_CALOSEL)  /*!< Calibration output is 1 Hz */
#define DDL_RTC_CALIB_OUTPUT_512HZ          (RTC_CTRL_CALOEN)                     /*!< Calibration output is 512 Hz */
/**
  * @}
  */
#endif /* BAKPR */

/** @defgroup RTC_DDL_EC_CALIB_SIGN Coarse digital calibration sign
  * @{
  */
#define DDL_RTC_CALIB_SIGN_POSITIVE         0x00000000U           /*!< Positive calibration: calendar update frequency is increased */
#define DDL_RTC_CALIB_SIGN_NEGATIVE         RTC_DCAL_DCALCFG        /*!< Negative calibration: calendar update frequency is decreased */
/**
  * @}
  */

/** @defgroup RTC_DDL_EC_CALIB_INSERTPULSE  Calibration pulse insertion
  * @{
  */
#define DDL_RTC_CALIB_INSERTPULSE_NONE      0x00000000U           /*!< No RTCCLK pulses are added */
#define DDL_RTC_CALIB_INSERTPULSE_SET       RTC_CAL_ICALFEN         /*!< One RTCCLK pulse is effectively inserted every 2exp11 pulses (frequency increased by 488.5 ppm) */
/**
  * @}
  */

/** @defgroup RTC_DDL_EC_CALIB_PERIOD  Calibration period
  * @{
  */
#define DDL_RTC_CALIB_PERIOD_32SEC          0x00000000U           /*!< Use a 32-second calibration cycle period */
#define DDL_RTC_CALIB_PERIOD_16SEC          RTC_CAL_CAL16CFG       /*!< Use a 16-second calibration cycle period */
#define DDL_RTC_CALIB_PERIOD_8SEC           RTC_CAL_CAL8CFG        /*!< Use a 8-second calibration cycle period */
/**
  * @}
  */

/** @defgroup RTC_DDL_EC_TSINSEL  TIMESTAMP mapping
  * @{
  */
#define DDL_RTC_TimeStampPin_Default        0x00000000U           /*!< Use RTC_AF1 as TIMESTAMP */
#if defined(RTC_AF2_SUPPORT)
#define DDL_RTC_TimeStampPin_Pos1           RTC_TACFG_TSMSEL     /*!< Use RTC_AF2 as TIMESTAMP */
#endif /* RTC_AF2_SUPPORT */
/**
  * @}
  */

/** @defgroup RTC_DDL_EC_TAMP1INSEL  TAMPER1 mapping
  * @{
  */
#define DDL_RTC_TamperPin_Default           0x00000000U           /*!< Use RTC_AF1 as TAMPER1 */
#if defined(RTC_AF2_SUPPORT)
#define DDL_RTC_TamperPin_Pos1              RTC_TACFG_TP1MSEL     /*!< Use RTC_AF2 as TAMPER1 */
#endif /* RTC_AF2_SUPPORT */

/**
  * @}
  */

/**
  * @}
  */

/* Exported macro ------------------------------------------------------------*/
/** @defgroup RTC_DDL_Exported_Macros RTC Exported Macros
  * @{
  */

