betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Include/apm32f4xx_ddl_rtc.h
/** @defgroup RTC_DDL_EM_WRITE_READ Common Write and read registers Macros
  * @{
  */

/**
  * @brief  Write a value in RTC register
  * @param  __INSTANCE__ RTC Instance
  * @param  __REG__ Register to be written
  * @param  __VALUE__ Value to be written in the register
  * @retval None
  */
#define DDL_RTC_WriteReg(__INSTANCE__, __REG__, __VALUE__) WRITE_REG(__INSTANCE__->__REG__, (__VALUE__))

/**
  * @brief  Read a value in RTC register
  * @param  __INSTANCE__ RTC Instance
  * @param  __REG__ Register to be read
  * @retval Register value
  */
#define DDL_RTC_ReadReg(__INSTANCE__, __REG__) READ_REG(__INSTANCE__->__REG__)
/**
  * @}
  */

/** @defgroup RTC_DDL_EM_Convert Convert helper Macros
  * @{
  */

/**
  * @brief  Helper macro to convert a value from 2 digit decimal format to BCD format
  * @param  __VALUE__ Byte to be converted
  * @retval Converted byte
  */
#define __DDL_RTC_CONVERT_BIN2BCD(__VALUE__) (uint8_t)((((__VALUE__) / 10U) << 4U) | ((__VALUE__) % 10U))

/**
  * @brief  Helper macro to convert a value from BCD format to 2 digit decimal format
  * @param  __VALUE__ BCD value to be converted
  * @retval Converted byte
  */
#define __DDL_RTC_CONVERT_BCD2BIN(__VALUE__) (uint8_t)(((uint8_t)((__VALUE__) & (uint8_t)0xF0U) >> (uint8_t)0x4U) * 10U + ((__VALUE__) & (uint8_t)0x0FU))

/**
  * @}
  */

/** @defgroup RTC_DDL_EM_Date Date helper Macros
  * @{
  */

/**
  * @brief  Helper macro to retrieve weekday.
  * @param  __RTC_DATE__ Date returned by @ref  DDL_RTC_DATE_Get function.
  * @retval Returned value can be one of the following values:
  *         @arg @ref DDL_RTC_WEEKDAY_MONDAY
  *         @arg @ref DDL_RTC_WEEKDAY_TUESDAY
  *         @arg @ref DDL_RTC_WEEKDAY_WEDNESDAY
  *         @arg @ref DDL_RTC_WEEKDAY_THURSDAY
  *         @arg @ref DDL_RTC_WEEKDAY_FRIDAY
  *         @arg @ref DDL_RTC_WEEKDAY_SATURDAY
  *         @arg @ref DDL_RTC_WEEKDAY_SUNDAY
  */
#define __DDL_RTC_GET_WEEKDAY(__RTC_DATE__) (((__RTC_DATE__) >> RTC_OFFSET_WEEKDAY) & 0x000000FFU)

/**
  * @brief  Helper macro to retrieve Year in BCD format
  * @param  __RTC_DATE__ Value returned by @ref  DDL_RTC_DATE_Get
  * @retval Year in BCD format (0x00 . . . 0x99)
  */
#define __DDL_RTC_GET_YEAR(__RTC_DATE__) ((__RTC_DATE__) & 0x000000FFU)

/**
  * @brief  Helper macro to retrieve Month in BCD format
  * @param  __RTC_DATE__ Value returned by @ref  DDL_RTC_DATE_Get
  * @retval Returned value can be one of the following values:
  *         @arg @ref DDL_RTC_MONTH_JANUARY
  *         @arg @ref DDL_RTC_MONTH_FEBRUARY
  *         @arg @ref DDL_RTC_MONTH_MARCH
  *         @arg @ref DDL_RTC_MONTH_APRIL
  *         @arg @ref DDL_RTC_MONTH_MAY
  *         @arg @ref DDL_RTC_MONTH_JUNE
  *         @arg @ref DDL_RTC_MONTH_JULY
  *         @arg @ref DDL_RTC_MONTH_AUGUST
  *         @arg @ref DDL_RTC_MONTH_SEPTEMBER
  *         @arg @ref DDL_RTC_MONTH_OCTOBER
  *         @arg @ref DDL_RTC_MONTH_NOVEMBER
  *         @arg @ref DDL_RTC_MONTH_DECEMBER
  */
#define __DDL_RTC_GET_MONTH(__RTC_DATE__) (((__RTC_DATE__) >>RTC_OFFSET_MONTH) & 0x000000FFU)

/**
  * @brief  Helper macro to retrieve Day in BCD format
  * @param  __RTC_DATE__ Value returned by @ref  DDL_RTC_DATE_Get
  * @retval Day in BCD format (0x01 . . . 0x31)
  */
#define __DDL_RTC_GET_DAY(__RTC_DATE__) (((__RTC_DATE__) >>RTC_OFFSET_DAY) & 0x000000FFU)

/**
  * @}
  */

/** @defgroup RTC_DDL_EM_Time Time helper Macros
  * @{
  */

/**
  * @brief  Helper macro to retrieve hour in BCD format
  * @param  __RTC_TIME__ RTC time returned by @ref DDL_RTC_TIME_Get function
  * @retval Hours in BCD format (0x01. . .0x12 or between Min_Data=0x00 and Max_Data=0x23)
  */
#define __DDL_RTC_GET_HOUR(__RTC_TIME__) (((__RTC_TIME__) >> RTC_OFFSET_HOUR) & 0x000000FFU)

/**
  * @brief  Helper macro to retrieve minute in BCD format
  * @param  __RTC_TIME__ RTC time returned by @ref DDL_RTC_TIME_Get function
  * @retval Minutes in BCD format (0x00. . .0x59)
  */
#define __DDL_RTC_GET_MINUTE(__RTC_TIME__) (((__RTC_TIME__) >> RTC_OFFSET_MINUTE) & 0x000000FFU)

/**
  * @brief  Helper macro to retrieve second in BCD format
  * @param  __RTC_TIME__ RTC time returned by @ref DDL_RTC_TIME_Get function
  * @retval Seconds in  format (0x00. . .0x59)
  */
#define __DDL_RTC_GET_SECOND(__RTC_TIME__) ((__RTC_TIME__) & 0x000000FFU)

/**
  * @}
  */

/**
  * @}
  */

/* Exported functions --------------------------------------------------------*/
/** @defgroup RTC_DDL_Exported_Functions RTC Exported Functions
  * @{
  */

/** @defgroup RTC_DDL_EF_Configuration Configuration
  * @{
  */
#if defined (RTC_CTRL_TIMEFCFG)
/**
  * @brief  Set Hours format (24 hour/day or AM/PM hour format)
  * @note   Bit is write-protected. @ref DDL_RTC_DisableWriteProtection function should be called before.
  * @note   It can be written in initialization mode only (@ref DDL_RTC_EnableInitMode function)
  * @param  RTCx RTC Instance
  * @param  HourFormat This parameter can be one of the following values:
  *         @arg @ref DDL_RTC_HOURFORMAT_24HOUR
  *         @arg @ref DDL_RTC_HOURFORMAT_AMPM
  * @retval None
  */
__STATIC_INLINE void DDL_RTC_SetHourFormat(RTC_TypeDef *RTCx, uint32_t HourFormat)
{
  MODIFY_REG(RTCx->CTRL, RTC_CTRL_TIMEFCFG, HourFormat);
}

/**
  * @brief  Get Hours format (24 hour/day or AM/PM hour format)
  * @param  RTCx RTC Instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref DDL_RTC_HOURFORMAT_24HOUR
  *         @arg @ref DDL_RTC_HOURFORMAT_AMPM
  */
__STATIC_INLINE uint32_t DDL_RTC_GetHourFormat(RTC_TypeDef *RTCx)
{
  return (uint32_t)(READ_BIT(RTCx->CTRL, RTC_CTRL_TIMEFCFG));
}
#endif /* RTC_CTRL_TIMEFCFG */

#if defined (RTC_CTRL_OUTSEL)
/**
  * @brief  Select the flag to be routed to RTC_ALARM output
  * @note   Bit is write-protected. @ref DDL_RTC_DisableWriteProtection function should be called before.
  * @param  RTCx RTC Instance
  * @param  AlarmOutput This parameter can be one of the following values:
  *         @arg @ref DDL_RTC_ALARMOUT_DISABLE
  *         @arg @ref DDL_RTC_ALARMOUT_ALMA
  *         @arg @ref DDL_RTC_ALARMOUT_ALMB
  *         @arg @ref DDL_RTC_ALARMOUT_WAKEUP
  * @retval None
  */
__STATIC_INLINE void DDL_RTC_SetAlarmOutEvent(RTC_TypeDef *RTCx, uint32_t AlarmOutput)
{
  MODIFY_REG(RTCx->CTRL, RTC_CTRL_OUTSEL, AlarmOutput);
}

/**
  * @brief  Get the flag to be routed to RTC_ALARM output
  * @param  RTCx RTC Instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref DDL_RTC_ALARMOUT_DISABLE
  *         @arg @ref DDL_RTC_ALARMOUT_ALMA
  *         @arg @ref DDL_RTC_ALARMOUT_ALMB
  *         @arg @ref DDL_RTC_ALARMOUT_WAKEUP
  */
__STATIC_INLINE uint32_t DDL_RTC_GetAlarmOutEvent(RTC_TypeDef *RTCx)
{
  return (uint32_t)(READ_BIT(RTCx->CTRL, RTC_CTRL_OUTSEL));
}
#endif /* RTC_CTRL_OUTSEL */

#if defined (RTC_TACFG_ALRMOT)
/**
  * @brief  Set RTC_ALARM output type (ALARM in push-pull or open-drain output)
  * @note   Used only when RTC_ALARM is mapped on PC13
  * @param  RTCx RTC Instance
  * @param  Output This parameter can be one of the following values:
  *         @arg @ref DDL_RTC_ALARM_OUTPUTTYPE_OPENDRAIN
  *         @arg @ref DDL_RTC_ALARM_OUTPUTTYPE_PUSHPULL
  * @retval None
  */
__STATIC_INLINE void DDL_RTC_SetAlarmOutputType(RTC_TypeDef *RTCx, uint32_t Output)
{
  MODIFY_REG(RTCx->TACFG, RTC_TACFG_ALRMOT, Output);
}

/**
  * @brief  Get RTC_ALARM output type (ALARM in push-pull or open-drain output)
  * @note   used only when RTC_ALARM is mapped on PC13
  * @param  RTCx RTC Instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref DDL_RTC_ALARM_OUTPUTTYPE_OPENDRAIN
  *         @arg @ref DDL_RTC_ALARM_OUTPUTTYPE_PUSHPULL
  */
__STATIC_INLINE uint32_t DDL_RTC_GetAlarmOutputType(RTC_TypeDef *RTCx)
{
  return (uint32_t)(READ_BIT(RTCx->TACFG, RTC_TACFG_ALRMOT));
}
#endif /* RTC_TACFG_ALRMOT */

#if defined (RTC_STS_INITEN)
/**
  * @brief  Enable initialization mode
  * @note   Initialization mode is used to program time and date register (RTC_TIME and RTC_DATE)
  *         and prescaler register (RTC_PSC).
  *         Counters are stopped and start counting from the new value when INIT is reset.
  * @param  RTCx RTC Instance
  * @retval None
  */
__STATIC_INLINE void DDL_RTC_EnableInitMode(RTC_TypeDef *RTCx)
{
  /* Set the Initialization mode */
  WRITE_REG(RTCx->STS, RTC_INIT_MASK);
}

/**
  * @brief  Disable initialization mode (Free running mode)
  * @param  RTCx RTC Instance
  * @retval None
  */
__STATIC_INLINE void DDL_RTC_DisableInitMode(RTC_TypeDef *RTCx)
{
  /* Exit Initialization mode */
  WRITE_REG(RTCx->STS, (uint32_t)~RTC_STS_INITEN);
}
#endif /* RTC_STS_INITEN */

