betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Include/apm32f4xx_ddl_rtc.h
#if defined (RTC_CTRL_POLCFG)
/**
  * @brief  Set Output polarity (pin is low when ALRAF/ALRBF/WUTF is asserted)
  * @note   Bit is write-protected. @ref DDL_RTC_DisableWriteProtection function should be called before.
  * @param  RTCx RTC Instance
  * @param  Polarity This parameter can be one of the following values:
  *         @arg @ref DDL_RTC_OUTPUTPOLARITY_PIN_HIGH
  *         @arg @ref DDL_RTC_OUTPUTPOLARITY_PIN_LOW
  * @retval None
  */
__STATIC_INLINE void DDL_RTC_SetOutputPolarity(RTC_TypeDef *RTCx, uint32_t Polarity)
{
  MODIFY_REG(RTCx->CTRL, RTC_CTRL_POLCFG, Polarity);
}

/**
  * @brief  Get Output polarity
  * @param  RTCx RTC Instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref DDL_RTC_OUTPUTPOLARITY_PIN_HIGH
  *         @arg @ref DDL_RTC_OUTPUTPOLARITY_PIN_LOW
  */
__STATIC_INLINE uint32_t DDL_RTC_GetOutputPolarity(RTC_TypeDef *RTCx)
{
  return (uint32_t)(READ_BIT(RTCx->CTRL, RTC_CTRL_POLCFG));
}
#endif /* RTC_CTRL_POLCFG */

#if defined (RTC_CTRL_RCMCFG)
/**
  * @brief  Enable Bypass the shadow registers
  * @note   Bit is write-protected. @ref DDL_RTC_DisableWriteProtection function should be called before.
  * @param  RTCx RTC Instance
  * @retval None
  */
__STATIC_INLINE void DDL_RTC_EnableShadowRegBypass(RTC_TypeDef *RTCx)
{
  SET_BIT(RTCx->CTRL, RTC_CTRL_RCMCFG);
}

/**
  * @brief  Disable Bypass the shadow registers
  * @param  RTCx RTC Instance
  * @retval None
  */
__STATIC_INLINE void DDL_RTC_DisableShadowRegBypass(RTC_TypeDef *RTCx)
{
  CLEAR_BIT(RTCx->CTRL, RTC_CTRL_RCMCFG);
}

/**
  * @brief  Check if Shadow registers bypass is enabled or not.
  * @param  RTCx RTC Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t DDL_RTC_IsShadowRegBypassEnabled(RTC_TypeDef *RTCx)
{
  return ((READ_BIT(RTCx->CTRL, RTC_CTRL_RCMCFG) == (RTC_CTRL_RCMCFG)) ? 1UL : 0UL);
}
#endif /* RTC_CTRL_RCMCFG */

#if defined (RTC_CTRL_RCLKDEN)
/**
  * @brief  Enable RTC_REFIN reference clock detection (50 or 60 Hz)
  * @note   Bit is write-protected. @ref DDL_RTC_DisableWriteProtection function should be called before.
  * @note   It can be written in initialization mode only (@ref DDL_RTC_EnableInitMode function)
  * @param  RTCx RTC Instance
  * @retval None
  */
__STATIC_INLINE void DDL_RTC_EnableRefClock(RTC_TypeDef *RTCx)
{
  SET_BIT(RTCx->CTRL, RTC_CTRL_RCLKDEN);
}

/**
  * @brief  Disable RTC_REFIN reference clock detection (50 or 60 Hz)
  * @note   Bit is write-protected. @ref DDL_RTC_DisableWriteProtection function should be called before.
  * @note   It can be written in initialization mode only (@ref DDL_RTC_EnableInitMode function)
  * @param  RTCx RTC Instance
  * @retval None
  */
__STATIC_INLINE void DDL_RTC_DisableRefClock(RTC_TypeDef *RTCx)
{
  CLEAR_BIT(RTCx->CTRL, RTC_CTRL_RCLKDEN);
}
#endif /* RTC_CTRL_RCLKDEN */

/**
  * @brief  Set Asynchronous prescaler factor
  * @param  RTCx RTC Instance
  * @param  AsynchPrescaler Value between Min_Data = 0 and Max_Data = 0x7F
  * @retval None
  */
__STATIC_INLINE void DDL_RTC_SetAsynchPrescaler(RTC_TypeDef *RTCx, uint32_t AsynchPrescaler)
{
#if defined (RTC_PSC_APSC)
  MODIFY_REG(RTCx->PSC, RTC_PSC_APSC, AsynchPrescaler << RTC_PSC_APSC_Pos);
#else
  MODIFY_REG(RTCx->PSCRLDH, RTC_PSCRLDH_PSCRLDH, (AsynchPrescaler >> 16));
  MODIFY_REG(RTCx->PSCRLDL, RTC_PSCRLDL_PSCRLDL, (AsynchPrescaler & RTC_PSCRLDL_PSCRLDL));
#endif /* RTC_PSC_APSC */
}

#if defined (RTC_PSC_APSC)
/**
  * @brief  Get Asynchronous prescaler factor
  * @param  RTCx RTC Instance
  * @retval Value between Min_Data = 0 and Max_Data = 0x7F
  */
__STATIC_INLINE uint32_t DDL_RTC_GetAsynchPrescaler(RTC_TypeDef *RTCx)
{
  return (uint32_t)(READ_BIT(RTCx->PSC, RTC_PSC_APSC) >> RTC_PSC_APSC_Pos);
}
#else
/**
  * @brief  Get Asynchronous prescaler factor
  * @param  RTCx RTC Instance
  * @retval Value between Min_Data = 0 and Max_Data = 0xFFFFF
  */
__STATIC_INLINE uint32_t DDL_RTC_GetDivider(RTC_TypeDef *RTCx)
{
  register uint16_t Highprescaler = 0, Lowprescaler = 0;
  Highprescaler = READ_REG(RTCx->PSCH & RTC_PSCH_PSCH);
  Lowprescaler  = READ_REG(RTCx->PSCL & RTC_PSCL_PSCL);

  return (((uint32_t) Highprescaler << 16U) | Lowprescaler);
}
#endif /* RTC_PSC_APSC */

#if defined (RTC_PSC_SPSC)
/**
  * @brief  Set Synchronous prescaler factor
  * @param  RTCx RTC Instance
  * @param  SynchPrescaler Value between Min_Data = 0 and Max_Data = 0x7FFF
  * @retval None
  */
__STATIC_INLINE void DDL_RTC_SetSynchPrescaler(RTC_TypeDef *RTCx, uint32_t SynchPrescaler)
{
  MODIFY_REG(RTCx->PSC, RTC_PSC_SPSC, SynchPrescaler);
}

/**
  * @brief  Get Synchronous prescaler factor
  * @param  RTCx RTC Instance
  * @retval Value between Min_Data = 0 and Max_Data = 0x7FFF
  */
__STATIC_INLINE uint32_t DDL_RTC_GetSynchPrescaler(RTC_TypeDef *RTCx)
{
  return (uint32_t)(READ_BIT(RTCx->PSC, RTC_PSC_SPSC));
}
#endif /* RTC_PSC_SPSC */

/**
  * @brief  Enable the write protection for RTC registers.
  * @param  RTCx RTC Instance
  * @retval None
  */
__STATIC_INLINE void DDL_RTC_EnableWriteProtection(RTC_TypeDef *RTCx)
{
#if defined (RTC_CSTS_CFGMFLG)
  CLEAR_BIT(RTCx->CSTS, RTC_CSTS_CFGMFLG);
#else
  WRITE_REG(RTCx->WRPROT, RTC_WRITE_PROTECTION_DISABLE);
#endif /* RTC_CSTS_CFGMFLG */
}

/**
  * @brief  Disable the write protection for RTC registers.
  * @param  RTCx RTC Instance
  * @retval None
  */
__STATIC_INLINE void DDL_RTC_DisableWriteProtection(RTC_TypeDef *RTCx)
{
#if defined (RTC_CSTS_CFGMFLG)
  SET_BIT(RTCx->CSTS, RTC_CSTS_CFGMFLG);
#else
  WRITE_REG(RTCx->WRPROT, RTC_WRITE_PROTECTION_ENABLE_1);
  WRITE_REG(RTCx->WRPROT, RTC_WRITE_PROTECTION_ENABLE_2);
#endif /* RTC_CSTS_CFGMFLG */
}

#if defined (BAKPR)
/**
  * @brief  Set Output Source
  * @param  BKPx BKP Instance
  * @param  OutputSource This parameter can be one of the following values:
  *         @arg @ref DDL_RTC_CALIB_OUTPUT_NONE
  *         @arg @ref DDL_RTC_CALIB_OUTPUT_RTCCLOCK
  *         @arg @ref DDL_RTC_CALIB_OUTPUT_ALARM
  *         @arg @ref DDL_RTC_CALIB_OUTPUT_SECOND
  * @retval None
  */
__STATIC_INLINE void DDL_RTC_SetOutputSource(BAKPR_TypeDef *BAKPRx, uint32_t OutputSource)
{
  MODIFY_REG(BAKPRx->CLKCAL, (BAKPR_CLKCAL_CALCOEN | BAKPR_CLKCAL_ASPOEN | BAKPR_CLKCAL_ASPOSEL), OutputSource);
}

/**
  * @brief  Get Output Source
  * @param  BKPx BKP Instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref DDL_RTC_CALIB_OUTPUT_NONE
  *         @arg @ref DDL_RTC_CALIB_OUTPUT_RTCCLOCK
  *         @arg @ref DDL_RTC_CALIB_OUTPUT_ALARM
  *         @arg @ref DDL_RTC_CALIB_OUTPUT_SECOND
  */
__STATIC_INLINE uint32_t DDL_RTC_GetOutPutSource(BAKPR_TypeDef *BAKPRx)
{
  return (uint32_t)(READ_BIT(BAKPRx->CLKCAL, (BAKPR_CLKCAL_CALCOEN | BAKPR_CLKCAL_ASPOEN | BAKPR_CLKCAL_ASPOSEL)));
}
#endif /* BAKPR */

/**
  * @}
  */

/** @defgroup RTC_DDL_EF_Time Time
  * @{
  */
#if defined (RTC_TIME_SUPPORT)
/**
  * @brief  Set time format (AM/24-hour or PM notation)
  * @note   Bit is write-protected. @ref DDL_RTC_DisableWriteProtection function should be called before.
  * @note   It can be written in initialization mode only (@ref DDL_RTC_EnableInitMode function)
  * @param  RTCx RTC Instance
  * @param  TimeFormat This parameter can be one of the following values:
  *         @arg @ref DDL_RTC_TIME_FORMAT_AM_OR_24
  *         @arg @ref DDL_RTC_TIME_FORMAT_PM
  * @retval None
  */
__STATIC_INLINE void DDL_RTC_TIME_SetFormat(RTC_TypeDef *RTCx, uint32_t TimeFormat)
{
  MODIFY_REG(RTCx->TIME, RTC_TIME_TIMEFCFG, TimeFormat);
}

/**
  * @brief  Get time format (AM or PM notation)
  * @note if shadow mode is disabled (BYPSHAD=0), need to check if RSF flag is set
  *       before reading this bit
  * @note Read either RTC_SUBSEC or RTC_TIME locks the values in the higher-order calendar
  *       shadow registers until RTC_DATE is read (DDL_RTC_ReadReg(RTC, DR)).
  * @param  RTCx RTC Instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref DDL_RTC_TIME_FORMAT_AM_OR_24
  *         @arg @ref DDL_RTC_TIME_FORMAT_PM
  */
__STATIC_INLINE uint32_t DDL_RTC_TIME_GetFormat(RTC_TypeDef *RTCx)
{
  return (uint32_t)(READ_BIT(RTCx->TIME, RTC_TIME_TIMEFCFG));
}

/**
  * @brief  Set Hours in BCD format
  * @note   Bit is write-protected. @ref DDL_RTC_DisableWriteProtection function should be called before.
  * @note   It can be written in initialization mode only (@ref DDL_RTC_EnableInitMode function)
  * @note helper macro __DDL_RTC_CONVERT_BIN2BCD is available to convert hour from binary to BCD format
  * @param  RTCx RTC Instance
  * @param  Hours Value between Min_Data=0x01 and Max_Data=0x12 or between Min_Data=0x00 and Max_Data=0x23
  * @retval None
  */
__STATIC_INLINE void DDL_RTC_TIME_SetHour(RTC_TypeDef *RTCx, uint32_t Hours)
{
  MODIFY_REG(RTCx->TIME, (RTC_TIME_HRT | RTC_TIME_HRU),
             (((Hours & 0xF0U) << (RTC_TIME_HRT_Pos - 4U)) | ((Hours & 0x0FU) << RTC_TIME_HRU_Pos)));
}

/**
  * @brief  Get Hours in BCD format
  * @note if shadow mode is disabled (BYPSHAD=0), need to check if RSF flag is set
  *       before reading this bit
  * @note Read either RTC_SUBSEC or RTC_TIME locks the values in the higher-order calendar
  *       shadow registers until RTC_DATE is read (DDL_RTC_ReadReg(RTC, DR)).
  * @note helper macro __DDL_RTC_CONVERT_BCD2BIN is available to convert hour from BCD to
  *       Binary format
  * @param  RTCx RTC Instance
  * @retval Value between Min_Data=0x01 and Max_Data=0x12 or between Min_Data=0x00 and Max_Data=0x23
  */
__STATIC_INLINE uint32_t DDL_RTC_TIME_GetHour(RTC_TypeDef *RTCx)
{
  return (uint32_t)((READ_BIT(RTCx->TIME, (RTC_TIME_HRT | RTC_TIME_HRU))) >> RTC_TIME_HRU_Pos);
}

/**
  * @brief  Set Minutes in BCD format
  * @note   Bit is write-protected. @ref DDL_RTC_DisableWriteProtection function should be called before.
  * @note   It can be written in initialization mode only (@ref DDL_RTC_EnableInitMode function)
  * @note helper macro __DDL_RTC_CONVERT_BIN2BCD is available to convert Minutes from binary to BCD format
  * @param  RTCx RTC Instance
  * @param  Minutes Value between Min_Data=0x00 and Max_Data=0x59
  * @retval None
  */
__STATIC_INLINE void DDL_RTC_TIME_SetMinute(RTC_TypeDef *RTCx, uint32_t Minutes)
{
  MODIFY_REG(RTCx->TIME, (RTC_TIME_MINT | RTC_TIME_MINU),
             (((Minutes & 0xF0U) << (RTC_TIME_MINT_Pos - 4U)) | ((Minutes & 0x0FU) << RTC_TIME_MINU_Pos)));
}

/**
  * @brief  Get Minutes in BCD format
  * @note if shadow mode is disabled (BYPSHAD=0), need to check if RSF flag is set
  *       before reading this bit
  * @note Read either RTC_SUBSEC or RTC_TIME locks the values in the higher-order calendar
  *       shadow registers until RTC_DATE is read (DDL_RTC_ReadReg(RTC, DR)).
  * @note helper macro __DDL_RTC_CONVERT_BCD2BIN is available to convert minute from BCD
  *       to Binary format
  * @param  RTCx RTC Instance
  * @retval Value between Min_Data=0x00 and Max_Data=0x59
  */
__STATIC_INLINE uint32_t DDL_RTC_TIME_GetMinute(RTC_TypeDef *RTCx)
{
  return (uint32_t)(READ_BIT(RTCx->TIME, (RTC_TIME_MINT | RTC_TIME_MINU)) >> RTC_TIME_MINU_Pos);
}

/**
  * @brief  Set Seconds in BCD format
  * @note   Bit is write-protected. @ref DDL_RTC_DisableWriteProtection function should be called before.
  * @note   It can be written in initialization mode only (@ref DDL_RTC_EnableInitMode function)
  * @note helper macro __DDL_RTC_CONVERT_BIN2BCD is available to convert Seconds from binary to BCD format
  * @param  RTCx RTC Instance
  * @param  Seconds Value between Min_Data=0x00 and Max_Data=0x59
  * @retval None
  */
__STATIC_INLINE void DDL_RTC_TIME_SetSecond(RTC_TypeDef *RTCx, uint32_t Seconds)
{
  MODIFY_REG(RTCx->TIME, (RTC_TIME_SECT | RTC_TIME_SECU),
             (((Seconds & 0xF0U) << (RTC_TIME_SECT_Pos - 4U)) | ((Seconds & 0x0FU) << RTC_TIME_SECU_Pos)));
}

/**
  * @brief  Get Seconds in BCD format
  * @note if shadow mode is disabled (BYPSHAD=0), need to check if RSF flag is set
  *       before reading this bit
  * @note Read either RTC_SUBSEC or RTC_TIME locks the values in the higher-order calendar
  *       shadow registers until RTC_DATE is read (DDL_RTC_ReadReg(RTC, DR)).
  * @note helper macro __DDL_RTC_CONVERT_BCD2BIN is available to convert Seconds from BCD
  *       to Binary format
  * @param  RTCx RTC Instance
  * @retval Value between Min_Data=0x00 and Max_Data=0x59
  */
__STATIC_INLINE uint32_t DDL_RTC_TIME_GetSecond(RTC_TypeDef *RTCx)
{
  return (uint32_t)(READ_BIT(RTCx->TIME, (RTC_TIME_SECT | RTC_TIME_SECU)) >> RTC_TIME_SECU_Pos);
}

/**
  * @brief  Set time (hour, minute and second) in BCD format
  * @note   Bit is write-protected. @ref DDL_RTC_DisableWriteProtection function should be called before.
  * @note   It can be written in initialization mode only (@ref DDL_RTC_EnableInitMode function)
  * @note TimeFormat and Hours should follow the same format
  * @param  RTCx RTC Instance
  * @param  Format12_24 This parameter can be one of the following values:
  *         @arg @ref DDL_RTC_TIME_FORMAT_AM_OR_24
  *         @arg @ref DDL_RTC_TIME_FORMAT_PM
  * @param  Hours Value between Min_Data=0x01 and Max_Data=0x12 or between Min_Data=0x00 and Max_Data=0x23
  * @param  Minutes Value between Min_Data=0x00 and Max_Data=0x59
  * @param  Seconds Value between Min_Data=0x00 and Max_Data=0x59
  * @retval None
  */
__STATIC_INLINE void DDL_RTC_TIME_Config(RTC_TypeDef *RTCx, uint32_t Format12_24, uint32_t Hours, uint32_t Minutes, uint32_t Seconds)
{
  uint32_t temp;

  temp = Format12_24                                                                            | \
         (((Hours   & 0xF0U) << (RTC_TIME_HRT_Pos  - 4U)) | ((Hours & 0x0FU) << RTC_TIME_HRU_Pos))    | \
         (((Minutes & 0xF0U) << (RTC_TIME_MINT_Pos - 4U)) | ((Minutes & 0x0FU) << RTC_TIME_MINU_Pos)) | \
         (((Seconds & 0xF0U) << (RTC_TIME_SECT_Pos  - 4U)) | ((Seconds & 0x0FU) << RTC_TIME_SECU_Pos));
  MODIFY_REG(RTCx->TIME, (RTC_TIME_TIMEFCFG | RTC_TIME_HRT | RTC_TIME_HRU | RTC_TIME_MINT | RTC_TIME_MINU | RTC_TIME_SECT | RTC_TIME_SECU), temp);
}

/**
  * @brief  Get time (hour, minute and second) in BCD format
  * @note if shadow mode is disabled (BYPSHAD=0), need to check if RSF flag is set
  *       before reading this bit
  * @note Read either RTC_SUBSEC or RTC_TIME locks the values in the higher-order calendar
  *       shadow registers until RTC_DATE is read (DDL_RTC_ReadReg(RTC, DR)).
  * @note helper macros __DDL_RTC_GET_HOUR, __DDL_RTC_GET_MINUTE and __DDL_RTC_GET_SECOND
  *       are available to get independently each parameter.
  * @param  RTCx RTC Instance
  * @retval Combination of hours, minutes and seconds (Format: 0x00HHMMSS).
  */
__STATIC_INLINE uint32_t DDL_RTC_TIME_Get(RTC_TypeDef *RTCx)
{
  return (uint32_t)(READ_BIT(RTCx->TIME, (RTC_TIME_HRT | RTC_TIME_HRU | RTC_TIME_MINT | RTC_TIME_MINU | RTC_TIME_SECT | RTC_TIME_SECU)));
}

/**
  * @brief  Memorize whether the daylight saving time change has been performed
  * @note   Bit is write-protected. @ref DDL_RTC_DisableWriteProtection function should be called before.
  * @param  RTCx RTC Instance
  * @retval None
  */
__STATIC_INLINE void DDL_RTC_TIME_EnableDayLightStore(RTC_TypeDef *RTCx)
{
  SET_BIT(RTCx->CTRL, RTC_CTRL_BAKP);
}

/**
  * @brief  Disable memorization whether the daylight saving time change has been performed.
  * @note   Bit is write-protected. @ref DDL_RTC_DisableWriteProtection function should be called before.
  * @param  RTCx RTC Instance
  * @retval None
  */
__STATIC_INLINE void DDL_RTC_TIME_DisableDayLightStore(RTC_TypeDef *RTCx)
{
  CLEAR_BIT(RTCx->CTRL, RTC_CTRL_BAKP);
}

/**
  * @brief  Check if RTC Day Light Saving stored operation has been enabled or not
  * @param  RTCx RTC Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t DDL_RTC_TIME_IsDayLightStoreEnabled(RTC_TypeDef *RTCx)
{
  return ((READ_BIT(RTCx->CTRL, RTC_CTRL_BAKP) == (RTC_CTRL_BAKP)) ? 1UL : 0UL);
}

/**
  * @brief  Subtract 1 hour (winter time change)
  * @note   Bit is write-protected. @ref DDL_RTC_DisableWriteProtection function should be called before.
  * @param  RTCx RTC Instance
  * @retval None
  */
__STATIC_INLINE void DDL_RTC_TIME_DecHour(RTC_TypeDef *RTCx)
{
  SET_BIT(RTCx->CTRL, RTC_CTRL_WTCCFG);
}

/**
  * @brief  Add 1 hour (summer time change)
  * @note   Bit is write-protected. @ref DDL_RTC_DisableWriteProtection function should be called before.
  * @param  RTCx RTC Instance
  * @retval None
  */
__STATIC_INLINE void DDL_RTC_TIME_IncHour(RTC_TypeDef *RTCx)
{
  SET_BIT(RTCx->CTRL, RTC_CTRL_STCCFG);
}

/**
  * @brief  Get subseconds value in the synchronous prescaler counter.
  * @note  You can use both SubSeconds value and SecondFraction (PREDIV_S through
  *        DDL_RTC_GetSynchPrescaler function) terms returned to convert Calendar
  *        SubSeconds value in second fraction ratio with time unit following
  *        generic formula:
  *          ==> Seconds fraction ratio * time_unit =
  *                 [(SecondFraction-SubSeconds)/(SecondFraction+1)] * time_unit
  *        This conversion can be performed only if no shift operation is pending
  *        (ie. SHFP=0) when PREDIV_S >= SS.
  * @param  RTCx RTC Instance
  * @retval Subseconds value (number between 0 and 65535)
  */
__STATIC_INLINE uint32_t DDL_RTC_TIME_GetSubSecond(RTC_TypeDef *RTCx)
{
  return (uint32_t)(READ_BIT(RTCx->SUBSEC, RTC_SUBSEC_SUBSEC));
}

/**
  * @brief  Synchronize to a remote clock with a high degree of precision.
  * @note   This operation effectively subtracts from (delays) or advance the clock of a fraction of a second.
  * @note   Bit is write-protected. @ref DDL_RTC_DisableWriteProtection function should be called before.
  * @note   When REFCKON is set, firmware must not write to Shift control register.
  * @param  RTCx RTC Instance
  * @param  ShiftSecond This parameter can be one of the following values:
  *         @arg @ref DDL_RTC_SHIFT_SECOND_DELAY
  *         @arg @ref DDL_RTC_SHIFT_SECOND_ADVANCE
  * @param  Fraction Number of Seconds Fractions (any value from 0 to 0x7FFF)
  * @retval None
  */
__STATIC_INLINE void DDL_RTC_TIME_Synchronize(RTC_TypeDef *RTCx, uint32_t ShiftSecond, uint32_t Fraction)
{
  WRITE_REG(RTCx->SHIFT, ShiftSecond | Fraction);
}
#endif /* RTC_TIME_SUPPORT */

#if defined (RTC_COUNT_SUPPORT)
/**
  * @brief  Set time counter in BCD format
  * @note   Bit is write-protected. @ref LL_RTC_DisableWriteProtection function should be called before.
  * @note   It can be written in initialization mode only (@ref LL_RTC_EnterInitMode function)
  * @param  RTCx RTC Instance
  * @param  TimeCounter Value between Min_Data=0x00 and Max_Data=0xFFFFF
  * @retval None
  */
__STATIC_INLINE void DDL_RTC_TIME_Set(RTC_TypeDef *RTCx, uint32_t TimeCounter)
{
  /* Set RTC COUNTER MSB word */
  WRITE_REG(RTCx->CNTH, (TimeCounter >> 16U));
  /* Set RTC COUNTER LSB word */
  WRITE_REG(RTCx->CNTL, (TimeCounter & RTC_CNTL_CNTL));
}

/**
  * @brief  Get time counter in BCD format
  * @param  RTCx RTC Instance
  * @retval Value between Min_Data = 0 and Max_Data = 0xFFFFF
  */
__STATIC_INLINE uint32_t DDL_RTC_TIME_Get(RTC_TypeDef *RTCx)
{
  register uint16_t high = 0, low = 0;

  high = READ_REG(RTCx->CNTH & RTC_CNTH_CNTH);
  low  = READ_REG(RTCx->CNTL & RTC_CNTL_CNTL);
  return ((uint32_t)(((uint32_t) high << 16U) | low));
}
#endif /* RTC_COUNT_SUPPORT */
/**
  * @}
  */

#if defined (RTC_CALENDAR_SUPPORT)
/** @defgroup RTC_DDL_EF_Date Date
  * @{
  */

/**
  * @brief  Set Year in BCD format
  * @note helper macro __DDL_RTC_CONVERT_BIN2BCD is available to convert Year from binary to BCD format
  * @param  RTCx RTC Instance
  * @param  Year Value between Min_Data=0x00 and Max_Data=0x99
  * @retval None
  */
__STATIC_INLINE void DDL_RTC_DATE_SetYear(RTC_TypeDef *RTCx, uint32_t Year)
{
  MODIFY_REG(RTCx->DATE, (RTC_DATE_YRT | RTC_DATE_YRU),
             (((Year & 0xF0U) << (RTC_DATE_YRT_Pos - 4U)) | ((Year & 0x0FU) << RTC_DATE_YRU_Pos)));
}

/**
  * @brief  Get Year in BCD format
  * @note if shadow mode is disabled (BYPSHAD=0), need to check if RSF flag is set
  *       before reading this bit
  * @note helper macro __DDL_RTC_CONVERT_BCD2BIN is available to convert Year from BCD to Binary format
  * @param  RTCx RTC Instance
  * @retval Value between Min_Data=0x00 and Max_Data=0x99
  */
__STATIC_INLINE uint32_t DDL_RTC_DATE_GetYear(RTC_TypeDef *RTCx)
{
  return (uint32_t)((READ_BIT(RTCx->DATE, (RTC_DATE_YRT | RTC_DATE_YRU))) >> RTC_DATE_YRU_Pos);
}

/**
  * @brief  Set Week day
  * @param  RTCx RTC Instance
  * @param  WeekDay This parameter can be one of the following values:
  *         @arg @ref DDL_RTC_WEEKDAY_MONDAY
  *         @arg @ref DDL_RTC_WEEKDAY_TUESDAY
  *         @arg @ref DDL_RTC_WEEKDAY_WEDNESDAY
  *         @arg @ref DDL_RTC_WEEKDAY_THURSDAY
  *         @arg @ref DDL_RTC_WEEKDAY_FRIDAY
  *         @arg @ref DDL_RTC_WEEKDAY_SATURDAY
  *         @arg @ref DDL_RTC_WEEKDAY_SUNDAY
  * @retval None
  */
__STATIC_INLINE void DDL_RTC_DATE_SetWeekDay(RTC_TypeDef *RTCx, uint32_t WeekDay)
{
  MODIFY_REG(RTCx->DATE, RTC_DATE_WEEKSEL, WeekDay << RTC_DATE_WEEKSEL_Pos);
}

/**
  * @brief  Get Week day
  * @note if shadow mode is disabled (BYPSHAD=0), need to check if RSF flag is set
  *       before reading this bit
  * @param  RTCx RTC Instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref DDL_RTC_WEEKDAY_MONDAY
  *         @arg @ref DDL_RTC_WEEKDAY_TUESDAY
  *         @arg @ref DDL_RTC_WEEKDAY_WEDNESDAY
  *         @arg @ref DDL_RTC_WEEKDAY_THURSDAY
  *         @arg @ref DDL_RTC_WEEKDAY_FRIDAY
  *         @arg @ref DDL_RTC_WEEKDAY_SATURDAY
  *         @arg @ref DDL_RTC_WEEKDAY_SUNDAY
  */
__STATIC_INLINE uint32_t DDL_RTC_DATE_GetWeekDay(RTC_TypeDef *RTCx)
{
  return (uint32_t)(READ_BIT(RTCx->DATE, RTC_DATE_WEEKSEL) >> RTC_DATE_WEEKSEL_Pos);
}

/**
  * @brief  Set Month in BCD format
  * @note helper macro __DDL_RTC_CONVERT_BIN2BCD is available to convert Month from binary to BCD format
  * @param  RTCx RTC Instance
  * @param  Month This parameter can be one of the following values:
  *         @arg @ref DDL_RTC_MONTH_JANUARY
  *         @arg @ref DDL_RTC_MONTH_FEBRUARY
  *         @arg @ref DDL_RTC_MONTH_MARCH
  *         @arg @ref DDL_RTC_MONTH_APRIL
  *         @arg @ref DDL_RTC_MONTH_MAY
  *         @arg @ref DDL_RTC_MONTH_JUNE
  *         @arg @ref DDL_RTC_MONTH_JULY
  *         @arg @ref DDL_RTC_MONTH_AUGUST
  *         @arg @ref DDL_RTC_MONTH_SEPTEMBER
  *         @arg @ref DDL_RTC_MONTH_OCTOBER
  *         @arg @ref DDL_RTC_MONTH_NOVEMBER
  *         @arg @ref DDL_RTC_MONTH_DECEMBER
  * @retval None
  */
__STATIC_INLINE void DDL_RTC_DATE_SetMonth(RTC_TypeDef *RTCx, uint32_t Month)
{
  MODIFY_REG(RTCx->DATE, (RTC_DATE_MONT | RTC_DATE_MONU),
             (((Month & 0xF0U) << (RTC_DATE_MONT_Pos - 4U)) | ((Month & 0x0FU) << RTC_DATE_MONU_Pos)));
}

/**
  * @brief  Get Month in BCD format
  * @note if shadow mode is disabled (BYPSHAD=0), need to check if RSF flag is set
  *       before reading this bit
  * @note helper macro __DDL_RTC_CONVERT_BCD2BIN is available to convert Month from BCD to Binary format
  * @param  RTCx RTC Instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref DDL_RTC_MONTH_JANUARY
  *         @arg @ref DDL_RTC_MONTH_FEBRUARY
  *         @arg @ref DDL_RTC_MONTH_MARCH
  *         @arg @ref DDL_RTC_MONTH_APRIL
  *         @arg @ref DDL_RTC_MONTH_MAY
  *         @arg @ref DDL_RTC_MONTH_JUNE
  *         @arg @ref DDL_RTC_MONTH_JULY
  *         @arg @ref DDL_RTC_MONTH_AUGUST
  *         @arg @ref DDL_RTC_MONTH_SEPTEMBER
  *         @arg @ref DDL_RTC_MONTH_OCTOBER
  *         @arg @ref DDL_RTC_MONTH_NOVEMBER
  *         @arg @ref DDL_RTC_MONTH_DECEMBER
  */
__STATIC_INLINE uint32_t DDL_RTC_DATE_GetMonth(RTC_TypeDef *RTCx)
{
  return (uint32_t)((READ_BIT(RTCx->DATE, (RTC_DATE_MONT | RTC_DATE_MONU))) >> RTC_DATE_MONU_Pos);
}

