betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Include/apm32f4xx_ddl_rtc.h
/**
  * @brief  Set Day in BCD format
  * @note helper macro __DDL_RTC_CONVERT_BIN2BCD is available to convert Day from binary to BCD format
  * @param  RTCx RTC Instance
  * @param  Day Value between Min_Data=0x01 and Max_Data=0x31
  * @retval None
  */
__STATIC_INLINE void DDL_RTC_DATE_SetDay(RTC_TypeDef *RTCx, uint32_t Day)
{
  MODIFY_REG(RTCx->DATE, (RTC_DATE_DAYT | RTC_DATE_DAYU),
             (((Day & 0xF0U) << (RTC_DATE_DAYT_Pos - 4U)) | ((Day & 0x0FU) << RTC_DATE_DAYU_Pos)));
}

/**
  * @brief  Get Day in BCD format
  * @note if shadow mode is disabled (BYPSHAD=0), need to check if RSF flag is set
  *       before reading this bit
  * @note helper macro __DDL_RTC_CONVERT_BCD2BIN is available to convert Day from BCD to Binary format
  * @param  RTCx RTC Instance
  * @retval Value between Min_Data=0x01 and Max_Data=0x31
  */
__STATIC_INLINE uint32_t DDL_RTC_DATE_GetDay(RTC_TypeDef *RTCx)
{
  return (uint32_t)((READ_BIT(RTCx->DATE, (RTC_DATE_DAYT | RTC_DATE_DAYU))) >> RTC_DATE_DAYU_Pos);
}

/**
  * @brief  Set date (WeekDay, Day, Month and Year) in BCD format
  * @param  RTCx RTC Instance
  * @param  WeekDay This parameter can be one of the following values:
  *         @arg @ref DDL_RTC_WEEKDAY_MONDAY
  *         @arg @ref DDL_RTC_WEEKDAY_TUESDAY
  *         @arg @ref DDL_RTC_WEEKDAY_WEDNESDAY
  *         @arg @ref DDL_RTC_WEEKDAY_THURSDAY
  *         @arg @ref DDL_RTC_WEEKDAY_FRIDAY
  *         @arg @ref DDL_RTC_WEEKDAY_SATURDAY
  *         @arg @ref DDL_RTC_WEEKDAY_SUNDAY
  * @param  Day Value between Min_Data=0x01 and Max_Data=0x31
  * @param  Month This parameter can be one of the following values:
  *         @arg @ref DDL_RTC_MONTH_JANUARY
  *         @arg @ref DDL_RTC_MONTH_FEBRUARY
  *         @arg @ref DDL_RTC_MONTH_MARCH
  *         @arg @ref DDL_RTC_MONTH_APRIL
  *         @arg @ref DDL_RTC_MONTH_MAY
  *         @arg @ref DDL_RTC_MONTH_JUNE
  *         @arg @ref DDL_RTC_MONTH_JULY
  *         @arg @ref DDL_RTC_MONTH_AUGUST
  *         @arg @ref DDL_RTC_MONTH_SEPTEMBER
  *         @arg @ref DDL_RTC_MONTH_OCTOBER
  *         @arg @ref DDL_RTC_MONTH_NOVEMBER
  *         @arg @ref DDL_RTC_MONTH_DECEMBER
  * @param  Year Value between Min_Data=0x00 and Max_Data=0x99
  * @retval None
  */
__STATIC_INLINE void DDL_RTC_DATE_Config(RTC_TypeDef *RTCx, uint32_t WeekDay, uint32_t Day, uint32_t Month, uint32_t Year)
{
  uint32_t temp;

  temp = (  WeekDay                                                    << RTC_DATE_WEEKSEL_Pos) | \
         (((Year  & 0xF0U) << (RTC_DATE_YRT_Pos - 4U)) | ((Year  & 0x0FU) << RTC_DATE_YRU_Pos)) | \
         (((Month & 0xF0U) << (RTC_DATE_MONT_Pos - 4U)) | ((Month & 0x0FU) << RTC_DATE_MONU_Pos)) | \
         (((Day   & 0xF0U) << (RTC_DATE_DAYT_Pos - 4U)) | ((Day   & 0x0FU) << RTC_DATE_DAYU_Pos));

  MODIFY_REG(RTCx->DATE, (RTC_DATE_WEEKSEL | RTC_DATE_MONT | RTC_DATE_MONU | RTC_DATE_DAYT | RTC_DATE_DAYU | RTC_DATE_YRT | RTC_DATE_YRU), temp);
}

/**
  * @brief  Get date (WeekDay, Day, Month and Year) in BCD format
  * @note if shadow mode is disabled (BYPSHAD=0), need to check if RSF flag is set
  *       before reading this bit
  * @note helper macros __DDL_RTC_GET_WEEKDAY, __DDL_RTC_GET_YEAR, __DDL_RTC_GET_MONTH,
  * and __DDL_RTC_GET_DAY are available to get independently each parameter.
  * @param  RTCx RTC Instance
  * @retval Combination of WeekDay, Day, Month and Year (Format: 0xWWDDMMYY).
  */
__STATIC_INLINE uint32_t DDL_RTC_DATE_Get(RTC_TypeDef *RTCx)
{
  uint32_t temp;

  temp = READ_BIT(RTCx->DATE, (RTC_DATE_WEEKSEL | RTC_DATE_MONT | RTC_DATE_MONU | RTC_DATE_DAYT | RTC_DATE_DAYU | RTC_DATE_YRT | RTC_DATE_YRU));

  return (uint32_t)((((temp &              RTC_DATE_WEEKSEL) >> RTC_DATE_WEEKSEL_Pos) << RTC_OFFSET_WEEKDAY) | \
                    (((temp & (RTC_DATE_DAYT | RTC_DATE_DAYU)) >> RTC_DATE_DAYU_Pos)  << RTC_OFFSET_DAY)     | \
                    (((temp & (RTC_DATE_MONT | RTC_DATE_MONU)) >> RTC_DATE_MONU_Pos)  << RTC_OFFSET_MONTH)   | \
                     ((temp & (RTC_DATE_YRT | RTC_DATE_YRU)) >> RTC_DATE_YRU_Pos));
}

/**
  * @}
  */
#endif /* RTC_CALENDAR_SUPPORT */

#if defined (RTC_ALARMA_SUPPORT)
/** @defgroup RTC_DDL_EF_ALARMA ALARMA
  * @{
  */

/**
  * @brief  Enable Alarm A
  * @note   Bit is write-protected. @ref DDL_RTC_DisableWriteProtection function should be called before.
  * @param  RTCx RTC Instance
  * @retval None
  */
__STATIC_INLINE void DDL_RTC_ALMA_Enable(RTC_TypeDef *RTCx)
{
  SET_BIT(RTCx->CTRL, RTC_CTRL_ALRAEN);
}

/**
  * @brief  Disable Alarm A
  * @note   Bit is write-protected. @ref DDL_RTC_DisableWriteProtection function should be called before.
  * @param  RTCx RTC Instance
  * @retval None
  */
__STATIC_INLINE void DDL_RTC_ALMA_Disable(RTC_TypeDef *RTCx)
{
  CLEAR_BIT(RTCx->CTRL, RTC_CTRL_ALRAEN);
}

/**
  * @brief  Specify the Alarm A masks.
  * @param  RTCx RTC Instance
  * @param  Mask This parameter can be a combination of the following values:
  *         @arg @ref DDL_RTC_ALMA_MASK_NONE
  *         @arg @ref DDL_RTC_ALMA_MASK_DATEWEEKDAY
  *         @arg @ref DDL_RTC_ALMA_MASK_HOURS
  *         @arg @ref DDL_RTC_ALMA_MASK_MINUTES
  *         @arg @ref DDL_RTC_ALMA_MASK_SECONDS
  *         @arg @ref DDL_RTC_ALMA_MASK_ALL
  * @retval None
  */
__STATIC_INLINE void DDL_RTC_ALMA_SetMask(RTC_TypeDef *RTCx, uint32_t Mask)
{
  MODIFY_REG(RTCx->ALRMA, RTC_ALRMA_DATEMEN | RTC_ALRMA_HRMEN | RTC_ALRMA_MINMEN | RTC_ALRMA_SECMEN, Mask);
}

/**
  * @brief  Get the Alarm A masks.
  * @param  RTCx RTC Instance
  * @retval Returned value can be can be a combination of the following values:
  *         @arg @ref DDL_RTC_ALMA_MASK_NONE
  *         @arg @ref DDL_RTC_ALMA_MASK_DATEWEEKDAY
  *         @arg @ref DDL_RTC_ALMA_MASK_HOURS
  *         @arg @ref DDL_RTC_ALMA_MASK_MINUTES
  *         @arg @ref DDL_RTC_ALMA_MASK_SECONDS
  *         @arg @ref DDL_RTC_ALMA_MASK_ALL
  */
__STATIC_INLINE uint32_t DDL_RTC_ALMA_GetMask(RTC_TypeDef *RTCx)
{
  return (uint32_t)(READ_BIT(RTCx->ALRMA, RTC_ALRMA_DATEMEN | RTC_ALRMA_HRMEN | RTC_ALRMA_MINMEN | RTC_ALRMA_SECMEN));
}

/**
  * @brief  Enable AlarmA Week day selection (DU[3:0] represents the week day. DT[1:0] is do not care)
  * @param  RTCx RTC Instance
  * @retval None
  */
__STATIC_INLINE void DDL_RTC_ALMA_EnableWeekday(RTC_TypeDef *RTCx)
{
  SET_BIT(RTCx->ALRMA, RTC_ALRMA_WEEKSEL);
}

/**
  * @brief  Disable AlarmA Week day selection (DU[3:0] represents the date )
  * @param  RTCx RTC Instance
  * @retval None
  */
__STATIC_INLINE void DDL_RTC_ALMA_DisableWeekday(RTC_TypeDef *RTCx)
{
  CLEAR_BIT(RTCx->ALRMA, RTC_ALRMA_WEEKSEL);
}

/**
  * @brief  Set ALARM A Day in BCD format
  * @note helper macro __DDL_RTC_CONVERT_BIN2BCD is available to convert Day from binary to BCD format
  * @param  RTCx RTC Instance
  * @param  Day Value between Min_Data=0x01 and Max_Data=0x31
  * @retval None
  */
__STATIC_INLINE void DDL_RTC_ALMA_SetDay(RTC_TypeDef *RTCx, uint32_t Day)
{
  MODIFY_REG(RTCx->ALRMA, (RTC_ALRMA_DAYT | RTC_ALRMA_DAYU),
             (((Day & 0xF0U) << (RTC_ALRMA_DAYT_Pos - 4U)) | ((Day & 0x0FU) << RTC_ALRMA_DAYU_Pos)));
}

/**
  * @brief  Get ALARM A Day in BCD format
  * @note helper macro __DDL_RTC_CONVERT_BCD2BIN is available to convert Day from BCD to Binary format
  * @param  RTCx RTC Instance
  * @retval Value between Min_Data=0x01 and Max_Data=0x31
  */
__STATIC_INLINE uint32_t DDL_RTC_ALMA_GetDay(RTC_TypeDef *RTCx)
{
  return (uint32_t)((READ_BIT(RTCx->ALRMA, (RTC_ALRMA_DAYT | RTC_ALRMA_DAYU))) >> RTC_ALRMA_DAYU_Pos);
}

/**
  * @brief  Set ALARM A Weekday
  * @param  RTCx RTC Instance
  * @param  WeekDay This parameter can be one of the following values:
  *         @arg @ref DDL_RTC_WEEKDAY_MONDAY
  *         @arg @ref DDL_RTC_WEEKDAY_TUESDAY
  *         @arg @ref DDL_RTC_WEEKDAY_WEDNESDAY
  *         @arg @ref DDL_RTC_WEEKDAY_THURSDAY
  *         @arg @ref DDL_RTC_WEEKDAY_FRIDAY
  *         @arg @ref DDL_RTC_WEEKDAY_SATURDAY
  *         @arg @ref DDL_RTC_WEEKDAY_SUNDAY
  * @retval None
  */
__STATIC_INLINE void DDL_RTC_ALMA_SetWeekDay(RTC_TypeDef *RTCx, uint32_t WeekDay)
{
  MODIFY_REG(RTCx->ALRMA, RTC_ALRMA_DAYU, WeekDay << RTC_ALRMA_DAYU_Pos);
}

/**
  * @brief  Get ALARM A Weekday
  * @param  RTCx RTC Instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref DDL_RTC_WEEKDAY_MONDAY
  *         @arg @ref DDL_RTC_WEEKDAY_TUESDAY
  *         @arg @ref DDL_RTC_WEEKDAY_WEDNESDAY
  *         @arg @ref DDL_RTC_WEEKDAY_THURSDAY
  *         @arg @ref DDL_RTC_WEEKDAY_FRIDAY
  *         @arg @ref DDL_RTC_WEEKDAY_SATURDAY
  *         @arg @ref DDL_RTC_WEEKDAY_SUNDAY
  */
__STATIC_INLINE uint32_t DDL_RTC_ALMA_GetWeekDay(RTC_TypeDef *RTCx)
{
  return (uint32_t)(READ_BIT(RTCx->ALRMA, RTC_ALRMA_DAYU) >> RTC_ALRMA_DAYU_Pos);
}

/**
  * @brief  Set Alarm A time format (AM/24-hour or PM notation)
  * @param  RTCx RTC Instance
  * @param  TimeFormat This parameter can be one of the following values:
  *         @arg @ref DDL_RTC_ALMA_TIME_FORMAT_AM
  *         @arg @ref DDL_RTC_ALMA_TIME_FORMAT_PM
  * @retval None
  */
__STATIC_INLINE void DDL_RTC_ALMA_SetTimeFormat(RTC_TypeDef *RTCx, uint32_t TimeFormat)
{
  MODIFY_REG(RTCx->ALRMA, RTC_ALRMA_TIMEFCFG, TimeFormat);
}

/**
  * @brief  Get Alarm A time format (AM or PM notation)
  * @param  RTCx RTC Instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref DDL_RTC_ALMA_TIME_FORMAT_AM
  *         @arg @ref DDL_RTC_ALMA_TIME_FORMAT_PM
  */
__STATIC_INLINE uint32_t DDL_RTC_ALMA_GetTimeFormat(RTC_TypeDef *RTCx)
{
  return (uint32_t)(READ_BIT(RTCx->ALRMA, RTC_ALRMA_TIMEFCFG));
}

/**
  * @brief  Set ALARM A Hours in BCD format
  * @note helper macro __DDL_RTC_CONVERT_BIN2BCD is available to convert Hours from binary to BCD format
  * @param  RTCx RTC Instance
  * @param  Hours Value between Min_Data=0x01 and Max_Data=0x12 or between Min_Data=0x00 and Max_Data=0x23
  * @retval None
  */
__STATIC_INLINE void DDL_RTC_ALMA_SetHour(RTC_TypeDef *RTCx, uint32_t Hours)
{
  MODIFY_REG(RTCx->ALRMA, (RTC_ALRMA_HRT | RTC_ALRMA_HRU),
             (((Hours & 0xF0U) << (RTC_ALRMA_HRT_Pos - 4U)) | ((Hours & 0x0FU) << RTC_ALRMA_HRU_Pos)));
}

/**
  * @brief  Get ALARM A Hours in BCD format
  * @note helper macro __DDL_RTC_CONVERT_BCD2BIN is available to convert Hours from BCD to Binary format
  * @param  RTCx RTC Instance
  * @retval Value between Min_Data=0x01 and Max_Data=0x12 or between Min_Data=0x00 and Max_Data=0x23
  */
__STATIC_INLINE uint32_t DDL_RTC_ALMA_GetHour(RTC_TypeDef *RTCx)
{
  return (uint32_t)((READ_BIT(RTCx->ALRMA, (RTC_ALRMA_HRT | RTC_ALRMA_HRU))) >> RTC_ALRMA_HRU_Pos);
}

/**
  * @brief  Set ALARM A Minutes in BCD format
  * @note helper macro __DDL_RTC_CONVERT_BIN2BCD is available to convert Minutes from binary to BCD format
  * @param  RTCx RTC Instance
  * @param  Minutes Value between Min_Data=0x00 and Max_Data=0x59
  * @retval None
  */
__STATIC_INLINE void DDL_RTC_ALMA_SetMinute(RTC_TypeDef *RTCx, uint32_t Minutes)
{
  MODIFY_REG(RTCx->ALRMA, (RTC_ALRMA_MINT | RTC_ALRMA_MINU),
             (((Minutes & 0xF0U) << (RTC_ALRMA_MINT_Pos - 4U)) | ((Minutes & 0x0FU) << RTC_ALRMA_MINU_Pos)));
}

/**
  * @brief  Get ALARM A Minutes in BCD format
  * @note helper macro __DDL_RTC_CONVERT_BCD2BIN is available to convert Minutes from BCD to Binary format
  * @param  RTCx RTC Instance
  * @retval Value between Min_Data=0x00 and Max_Data=0x59
  */
__STATIC_INLINE uint32_t DDL_RTC_ALMA_GetMinute(RTC_TypeDef *RTCx)
{
  return (uint32_t)((READ_BIT(RTCx->ALRMA, (RTC_ALRMA_MINT | RTC_ALRMA_MINU))) >> RTC_ALRMA_MINU_Pos);
}

/**
  * @brief  Set ALARM A Seconds in BCD format
  * @note helper macro __DDL_RTC_CONVERT_BIN2BCD is available to convert Seconds from binary to BCD format
  * @param  RTCx RTC Instance
  * @param  Seconds Value between Min_Data=0x00 and Max_Data=0x59
  * @retval None
  */
__STATIC_INLINE void DDL_RTC_ALMA_SetSecond(RTC_TypeDef *RTCx, uint32_t Seconds)
{
  MODIFY_REG(RTCx->ALRMA, (RTC_ALRMA_SECT | RTC_ALRMA_SECU),
             (((Seconds & 0xF0U) << (RTC_ALRMA_SECT_Pos - 4U)) | ((Seconds & 0x0FU) << RTC_ALRMA_SECU_Pos)));
}

/**
  * @brief  Get ALARM A Seconds in BCD format
  * @note helper macro __DDL_RTC_CONVERT_BCD2BIN is available to convert Seconds from BCD to Binary format
  * @param  RTCx RTC Instance
  * @retval Value between Min_Data=0x00 and Max_Data=0x59
  */
__STATIC_INLINE uint32_t DDL_RTC_ALMA_GetSecond(RTC_TypeDef *RTCx)
{
  return (uint32_t)((READ_BIT(RTCx->ALRMA, (RTC_ALRMA_SECT | RTC_ALRMA_SECU))) >> RTC_ALRMA_SECU_Pos);
}

/**
  * @brief  Set Alarm A Time (hour, minute and second) in BCD format
  * @param  RTCx RTC Instance
  * @param  Format12_24 This parameter can be one of the following values:
  *         @arg @ref DDL_RTC_ALMA_TIME_FORMAT_AM
  *         @arg @ref DDL_RTC_ALMA_TIME_FORMAT_PM
  * @param  Hours Value between Min_Data=0x01 and Max_Data=0x12 or between Min_Data=0x00 and Max_Data=0x23
  * @param  Minutes Value between Min_Data=0x00 and Max_Data=0x59
  * @param  Seconds Value between Min_Data=0x00 and Max_Data=0x59
  * @retval None
  */
__STATIC_INLINE void DDL_RTC_ALMA_ConfigTime(RTC_TypeDef *RTCx, uint32_t Format12_24, uint32_t Hours, uint32_t Minutes, uint32_t Seconds)
{
  uint32_t temp;

  temp = Format12_24                                                                                    | \
         (((Hours   & 0xF0U) << (RTC_ALRMA_HRT_Pos  - 4U)) | ((Hours   & 0x0FU) << RTC_ALRMA_HRU_Pos))  | \
         (((Minutes & 0xF0U) << (RTC_ALRMA_MINT_Pos - 4U)) | ((Minutes & 0x0FU) << RTC_ALRMA_MINU_Pos)) | \
         (((Seconds & 0xF0U) << (RTC_ALRMA_SECT_Pos  - 4U)) | ((Seconds & 0x0FU) << RTC_ALRMA_SECU_Pos));

  MODIFY_REG(RTCx->ALRMA, RTC_ALRMA_TIMEFCFG | RTC_ALRMA_HRT | RTC_ALRMA_HRU | RTC_ALRMA_MINT | RTC_ALRMA_MINU | RTC_ALRMA_SECT | RTC_ALRMA_SECU, temp);
}

/**
  * @brief  Get Alarm B Time (hour, minute and second) in BCD format
  * @note helper macros __DDL_RTC_GET_HOUR, __DDL_RTC_GET_MINUTE and __DDL_RTC_GET_SECOND
  * are available to get independently each parameter.
  * @param  RTCx RTC Instance
  * @retval Combination of hours, minutes and seconds.
  */
__STATIC_INLINE uint32_t DDL_RTC_ALMA_GetTime(RTC_TypeDef *RTCx)
{
  return (uint32_t)((DDL_RTC_ALMA_GetHour(RTCx) << RTC_OFFSET_HOUR) | (DDL_RTC_ALMA_GetMinute(RTCx) << RTC_OFFSET_MINUTE) | DDL_RTC_ALMA_GetSecond(RTCx));
}

/**
  * @brief  Mask the most-significant bits of the subseconds field starting from
  *         the bit specified in parameter Mask
  * @note This register can be written only when ALRAE is reset in RTC_CTRL register,
  *       or in initialization mode.
  * @param  RTCx RTC Instance
  * @param  Mask Value between Min_Data=0x00 and Max_Data=0xF
  * @retval None
  */
__STATIC_INLINE void DDL_RTC_ALMA_SetSubSecondMask(RTC_TypeDef *RTCx, uint32_t Mask)
{
  MODIFY_REG(RTCx->ALRMASS, RTC_ALRMASS_MASKSEL, Mask << RTC_ALRMASS_MASKSEL_Pos);
}

/**
  * @brief  Get Alarm A subseconds mask
  * @param  RTCx RTC Instance
  * @retval Value between Min_Data=0x00 and Max_Data=0xF
  */
__STATIC_INLINE uint32_t DDL_RTC_ALMA_GetSubSecondMask(RTC_TypeDef *RTCx)
{
  return (uint32_t)(READ_BIT(RTCx->ALRMASS, RTC_ALRMASS_MASKSEL) >> RTC_ALRMASS_MASKSEL_Pos);
}

/**
  * @brief  Set Alarm A subseconds value
  * @param  RTCx RTC Instance
  * @param  Subsecond Value between Min_Data=0x00 and Max_Data=0x7FFF
  * @retval None
  */
__STATIC_INLINE void DDL_RTC_ALMA_SetSubSecond(RTC_TypeDef *RTCx, uint32_t Subsecond)
{
  MODIFY_REG(RTCx->ALRMASS, RTC_ALRMASS_SUBSEC, Subsecond);
}

/**
  * @brief  Get Alarm A subseconds value
  * @param  RTCx RTC Instance
  * @retval Value between Min_Data=0x00 and Max_Data=0x7FFF
  */
__STATIC_INLINE uint32_t DDL_RTC_ALMA_GetSubSecond(RTC_TypeDef *RTCx)
{
  return (uint32_t)(READ_BIT(RTCx->ALRMASS, RTC_ALRMASS_SUBSEC));
}

/**
  * @}
  */
#endif /* RTC_ALARMA_SUPPORT */

#if defined (RTC_ALARMB_SUPPORT)
/** @defgroup RTC_DDL_EF_ALARMB ALARMB
  * @{
  */

/**
  * @brief  Enable Alarm B
  * @note   Bit is write-protected. @ref DDL_RTC_DisableWriteProtection function should be called before.
  * @param  RTCx RTC Instance
  * @retval None
  */
__STATIC_INLINE void DDL_RTC_ALMB_Enable(RTC_TypeDef *RTCx)
{
  SET_BIT(RTCx->CTRL, RTC_CTRL_ALRBEN);
}

/**
  * @brief  Disable Alarm B
  * @note   Bit is write-protected. @ref DDL_RTC_DisableWriteProtection function should be called before.
  * @param  RTCx RTC Instance
  * @retval None
  */
__STATIC_INLINE void DDL_RTC_ALMB_Disable(RTC_TypeDef *RTCx)
{
  CLEAR_BIT(RTCx->CTRL, RTC_CTRL_ALRBEN);
}

/**
  * @brief  Specify the Alarm B masks.
  * @param  RTCx RTC Instance
  * @param  Mask This parameter can be a combination of the following values:
  *         @arg @ref DDL_RTC_ALMB_MASK_NONE
  *         @arg @ref DDL_RTC_ALMB_MASK_DATEWEEKDAY
  *         @arg @ref DDL_RTC_ALMB_MASK_HOURS
  *         @arg @ref DDL_RTC_ALMB_MASK_MINUTES
  *         @arg @ref DDL_RTC_ALMB_MASK_SECONDS
  *         @arg @ref DDL_RTC_ALMB_MASK_ALL
  * @retval None
  */
__STATIC_INLINE void DDL_RTC_ALMB_SetMask(RTC_TypeDef *RTCx, uint32_t Mask)
{
  MODIFY_REG(RTCx->ALRMB, RTC_ALRMB_DATEMEN | RTC_ALRMB_HRMEN | RTC_ALRMB_MINMEN | RTC_ALRMB_SECMEN, Mask);
}

/**
  * @brief  Get the Alarm B masks.
  * @param  RTCx RTC Instance
  * @retval Returned value can be can be a combination of the following values:
  *         @arg @ref DDL_RTC_ALMB_MASK_NONE
  *         @arg @ref DDL_RTC_ALMB_MASK_DATEWEEKDAY
  *         @arg @ref DDL_RTC_ALMB_MASK_HOURS
  *         @arg @ref DDL_RTC_ALMB_MASK_MINUTES
  *         @arg @ref DDL_RTC_ALMB_MASK_SECONDS
  *         @arg @ref DDL_RTC_ALMB_MASK_ALL
  */
__STATIC_INLINE uint32_t DDL_RTC_ALMB_GetMask(RTC_TypeDef *RTCx)
{
  return (uint32_t)(READ_BIT(RTCx->ALRMB, RTC_ALRMB_DATEMEN | RTC_ALRMB_HRMEN | RTC_ALRMB_MINMEN | RTC_ALRMB_SECMEN));
}

/**
  * @brief  Enable AlarmB Week day selection (DU[3:0] represents the week day. DT[1:0] is do not care)
  * @param  RTCx RTC Instance
  * @retval None
  */
__STATIC_INLINE void DDL_RTC_ALMB_EnableWeekday(RTC_TypeDef *RTCx)
{
  SET_BIT(RTCx->ALRMB, RTC_ALRMB_WEEKSEL);
}

/**
  * @brief  Disable AlarmB Week day selection (DU[3:0] represents the date )
  * @param  RTCx RTC Instance
  * @retval None
  */
__STATIC_INLINE void DDL_RTC_ALMB_DisableWeekday(RTC_TypeDef *RTCx)
{
  CLEAR_BIT(RTCx->ALRMB, RTC_ALRMB_WEEKSEL);
}

/**
  * @brief  Set ALARM B Day in BCD format
  * @note helper macro __DDL_RTC_CONVERT_BIN2BCD is available to convert Day from binary to BCD format
  * @param  RTCx RTC Instance
  * @param  Day Value between Min_Data=0x01 and Max_Data=0x31
  * @retval None
  */
__STATIC_INLINE void DDL_RTC_ALMB_SetDay(RTC_TypeDef *RTCx, uint32_t Day)
{
  MODIFY_REG(RTCx->ALRMB, (RTC_ALRMB_DAYT | RTC_ALRMB_DAYU),
             (((Day & 0xF0U) << (RTC_ALRMB_DAYT_Pos - 4U)) | ((Day & 0x0FU) << RTC_ALRMB_DAYU_Pos)));
}

/**
  * @brief  Get ALARM B Day in BCD format
  * @note helper macro __DDL_RTC_CONVERT_BCD2BIN is available to convert Day from BCD to Binary format
  * @param  RTCx RTC Instance
  * @retval Value between Min_Data=0x01 and Max_Data=0x31
  */
__STATIC_INLINE uint32_t DDL_RTC_ALMB_GetDay(RTC_TypeDef *RTCx)
{
  return (uint32_t)((READ_BIT(RTCx->ALRMB, (RTC_ALRMB_DAYT | RTC_ALRMB_DAYU))) >> RTC_ALRMB_DAYU_Pos);
}

/**
  * @brief  Set ALARM B Weekday
  * @param  RTCx RTC Instance
  * @param  WeekDay This parameter can be one of the following values:
  *         @arg @ref DDL_RTC_WEEKDAY_MONDAY
  *         @arg @ref DDL_RTC_WEEKDAY_TUESDAY
  *         @arg @ref DDL_RTC_WEEKDAY_WEDNESDAY
  *         @arg @ref DDL_RTC_WEEKDAY_THURSDAY
  *         @arg @ref DDL_RTC_WEEKDAY_FRIDAY
  *         @arg @ref DDL_RTC_WEEKDAY_SATURDAY
  *         @arg @ref DDL_RTC_WEEKDAY_SUNDAY
  * @retval None
  */
__STATIC_INLINE void DDL_RTC_ALMB_SetWeekDay(RTC_TypeDef *RTCx, uint32_t WeekDay)
{
  MODIFY_REG(RTCx->ALRMB, RTC_ALRMB_DAYU, WeekDay << RTC_ALRMB_DAYU_Pos);
}

/**
  * @brief  Get ALARM B Weekday
  * @param  RTCx RTC Instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref DDL_RTC_WEEKDAY_MONDAY
  *         @arg @ref DDL_RTC_WEEKDAY_TUESDAY
  *         @arg @ref DDL_RTC_WEEKDAY_WEDNESDAY
  *         @arg @ref DDL_RTC_WEEKDAY_THURSDAY
  *         @arg @ref DDL_RTC_WEEKDAY_FRIDAY
  *         @arg @ref DDL_RTC_WEEKDAY_SATURDAY
  *         @arg @ref DDL_RTC_WEEKDAY_SUNDAY
  */
__STATIC_INLINE uint32_t DDL_RTC_ALMB_GetWeekDay(RTC_TypeDef *RTCx)
{
  return (uint32_t)(READ_BIT(RTCx->ALRMB, RTC_ALRMB_DAYU) >> RTC_ALRMB_DAYU_Pos);
}

/**
  * @brief  Set ALARM B time format (AM/24-hour or PM notation)
  * @param  RTCx RTC Instance
  * @param  TimeFormat This parameter can be one of the following values:
  *         @arg @ref DDL_RTC_ALMB_TIME_FORMAT_AM
  *         @arg @ref DDL_RTC_ALMB_TIME_FORMAT_PM
  * @retval None
  */
__STATIC_INLINE void DDL_RTC_ALMB_SetTimeFormat(RTC_TypeDef *RTCx, uint32_t TimeFormat)
{
  MODIFY_REG(RTCx->ALRMB, RTC_ALRMB_TIMEFCFG, TimeFormat);
}

/**
  * @brief  Get ALARM B time format (AM or PM notation)
  * @param  RTCx RTC Instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref DDL_RTC_ALMB_TIME_FORMAT_AM
  *         @arg @ref DDL_RTC_ALMB_TIME_FORMAT_PM
  */
__STATIC_INLINE uint32_t DDL_RTC_ALMB_GetTimeFormat(RTC_TypeDef *RTCx)
{
  return (uint32_t)(READ_BIT(RTCx->ALRMB, RTC_ALRMB_TIMEFCFG));
}

/**
  * @brief  Set ALARM B Hours in BCD format
  * @note helper macro __DDL_RTC_CONVERT_BIN2BCD is available to convert Hours from binary to BCD format
  * @param  RTCx RTC Instance
  * @param  Hours Value between Min_Data=0x01 and Max_Data=0x12 or between Min_Data=0x00 and Max_Data=0x23
  * @retval None
  */
__STATIC_INLINE void DDL_RTC_ALMB_SetHour(RTC_TypeDef *RTCx, uint32_t Hours)
{
  MODIFY_REG(RTCx->ALRMB, (RTC_ALRMB_HRT | RTC_ALRMB_HRU),
             (((Hours & 0xF0U) << (RTC_ALRMB_HRT_Pos - 4U)) | ((Hours & 0x0FU) << RTC_ALRMB_HRU_Pos)));
}

/**
  * @brief  Get ALARM B Hours in BCD format
  * @note helper macro __DDL_RTC_CONVERT_BCD2BIN is available to convert Hours from BCD to Binary format
  * @param  RTCx RTC Instance
  * @retval Value between Min_Data=0x01 and Max_Data=0x12 or between Min_Data=0x00 and Max_Data=0x23
  */
__STATIC_INLINE uint32_t DDL_RTC_ALMB_GetHour(RTC_TypeDef *RTCx)
{
  return (uint32_t)((READ_BIT(RTCx->ALRMB, (RTC_ALRMB_HRT | RTC_ALRMB_HRU))) >> RTC_ALRMB_HRU_Pos);
}

/**
  * @brief  Set ALARM B Minutes in BCD format
  * @note helper macro __DDL_RTC_CONVERT_BIN2BCD is available to convert Minutes from binary to BCD format
  * @param  RTCx RTC Instance
  * @param  Minutes between Min_Data=0x00 and Max_Data=0x59
  * @retval None
  */
__STATIC_INLINE void DDL_RTC_ALMB_SetMinute(RTC_TypeDef *RTCx, uint32_t Minutes)
{
  MODIFY_REG(RTCx->ALRMB, (RTC_ALRMB_MINT | RTC_ALRMB_MINU),
             (((Minutes & 0xF0U) << (RTC_ALRMB_MINT_Pos - 4U)) | ((Minutes & 0x0FU) << RTC_ALRMB_MINU_Pos)));
}

/**
  * @brief  Get ALARM B Minutes in BCD format
  * @note helper macro __DDL_RTC_CONVERT_BCD2BIN is available to convert Minutes from BCD to Binary format
  * @param  RTCx RTC Instance
  * @retval Value between Min_Data=0x00 and Max_Data=0x59
  */
__STATIC_INLINE uint32_t DDL_RTC_ALMB_GetMinute(RTC_TypeDef *RTCx)
{
  return (uint32_t)((READ_BIT(RTCx->ALRMB, (RTC_ALRMB_MINT | RTC_ALRMB_MINU))) >> RTC_ALRMB_MINU_Pos);
}

/**
  * @brief  Set ALARM B Seconds in BCD format
  * @note helper macro __DDL_RTC_CONVERT_BIN2BCD is available to convert Seconds from binary to BCD format
  * @param  RTCx RTC Instance
  * @param  Seconds Value between Min_Data=0x00 and Max_Data=0x59
  * @retval None
  */
__STATIC_INLINE void DDL_RTC_ALMB_SetSecond(RTC_TypeDef *RTCx, uint32_t Seconds)
{
  MODIFY_REG(RTCx->ALRMB, (RTC_ALRMB_SECT | RTC_ALRMB_SECU),
             (((Seconds & 0xF0U) << (RTC_ALRMB_SECT_Pos - 4U)) | ((Seconds & 0x0FU) << RTC_ALRMB_SECU_Pos)));
}

