betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Include/apm32f4xx_ddl_rtc.h
/**
  * @brief  Get ALARM B Seconds in BCD format
  * @note helper macro __DDL_RTC_CONVERT_BCD2BIN is available to convert Seconds from BCD to Binary format
  * @param  RTCx RTC Instance
  * @retval Value between Min_Data=0x00 and Max_Data=0x59
  */
__STATIC_INLINE uint32_t DDL_RTC_ALMB_GetSecond(RTC_TypeDef *RTCx)
{
  return (uint32_t)((READ_BIT(RTCx->ALRMB, (RTC_ALRMB_SECT | RTC_ALRMB_SECU))) >> RTC_ALRMB_SECU_Pos);
}

/**
  * @brief  Set Alarm B Time (hour, minute and second) in BCD format
  * @param  RTCx RTC Instance
  * @param  Format12_24 This parameter can be one of the following values:
  *         @arg @ref DDL_RTC_ALMB_TIME_FORMAT_AM
  *         @arg @ref DDL_RTC_ALMB_TIME_FORMAT_PM
  * @param  Hours Value between Min_Data=0x01 and Max_Data=0x12 or between Min_Data=0x00 and Max_Data=0x23
  * @param  Minutes Value between Min_Data=0x00 and Max_Data=0x59
  * @param  Seconds Value between Min_Data=0x00 and Max_Data=0x59
  * @retval None
  */
__STATIC_INLINE void DDL_RTC_ALMB_ConfigTime(RTC_TypeDef *RTCx, uint32_t Format12_24, uint32_t Hours, uint32_t Minutes, uint32_t Seconds)
{
  uint32_t temp;

  temp = Format12_24                                                                                    | \
         (((Hours   & 0xF0U) << (RTC_ALRMB_HRT_Pos  - 4U)) | ((Hours   & 0x0FU) << RTC_ALRMB_HRU_Pos))  | \
         (((Minutes & 0xF0U) << (RTC_ALRMB_MINT_Pos - 4U)) | ((Minutes & 0x0FU) << RTC_ALRMB_MINU_Pos)) | \
         (((Seconds & 0xF0U) << (RTC_ALRMB_SECT_Pos  - 4U)) | ((Seconds & 0x0FU) << RTC_ALRMB_SECU_Pos));

  MODIFY_REG(RTCx->ALRMB, RTC_ALRMB_TIMEFCFG | RTC_ALRMB_HRT | RTC_ALRMB_HRU | RTC_ALRMB_MINT | RTC_ALRMB_MINU | RTC_ALRMB_SECT | RTC_ALRMB_SECU, temp);
}

/**
  * @brief  Get Alarm B Time (hour, minute and second) in BCD format
  * @note helper macros __DDL_RTC_GET_HOUR, __DDL_RTC_GET_MINUTE and __DDL_RTC_GET_SECOND
  * are available to get independently each parameter.
  * @param  RTCx RTC Instance
  * @retval Combination of hours, minutes and seconds.
  */
__STATIC_INLINE uint32_t DDL_RTC_ALMB_GetTime(RTC_TypeDef *RTCx)
{
  return (uint32_t)((DDL_RTC_ALMB_GetHour(RTCx) << RTC_OFFSET_HOUR) | (DDL_RTC_ALMB_GetMinute(RTCx) << RTC_OFFSET_MINUTE) | DDL_RTC_ALMB_GetSecond(RTCx));
}

/**
  * @brief  Mask the most-significant bits of the subseconds field starting from
  *         the bit specified in parameter Mask
  * @note This register can be written only when ALRBE is reset in RTC_CTRL register,
  *       or in initialization mode.
  * @param  RTCx RTC Instance
  * @param  Mask Value between Min_Data=0x00 and Max_Data=0xF
  * @retval None
  */
__STATIC_INLINE void DDL_RTC_ALMB_SetSubSecondMask(RTC_TypeDef *RTCx, uint32_t Mask)
{
  MODIFY_REG(RTCx->ALRMBSS, RTC_ALRMBSS_MASKSEL, Mask << RTC_ALRMBSS_MASKSEL_Pos);
}

/**
  * @brief  Get Alarm B subseconds mask
  * @param  RTCx RTC Instance
  * @retval Value between Min_Data=0x00 and Max_Data=0xF
  */
__STATIC_INLINE uint32_t DDL_RTC_ALMB_GetSubSecondMask(RTC_TypeDef *RTCx)
{
  return (uint32_t)(READ_BIT(RTCx->ALRMBSS, RTC_ALRMBSS_MASKSEL)  >> RTC_ALRMBSS_MASKSEL_Pos);
}

/**
  * @brief  Set Alarm B subseconds value
  * @param  RTCx RTC Instance
  * @param  Subsecond Value between Min_Data=0x00 and Max_Data=0x7FFF
  * @retval None
  */
__STATIC_INLINE void DDL_RTC_ALMB_SetSubSecond(RTC_TypeDef *RTCx, uint32_t Subsecond)
{
  MODIFY_REG(RTCx->ALRMBSS, RTC_ALRMBSS_SUBSEC, Subsecond);
}

/**
  * @brief  Get Alarm B subseconds value
  * @param  RTCx RTC Instance
  * @retval Value between Min_Data=0x00 and Max_Data=0x7FFF
  */
__STATIC_INLINE uint32_t DDL_RTC_ALMB_GetSubSecond(RTC_TypeDef *RTCx)
{
  return (uint32_t)(READ_BIT(RTCx->ALRMBSS, RTC_ALRMBSS_SUBSEC));
}

/**
  * @}
  */
#endif /* RTC_ALARMB_SUPPORT */

#if defined (RTC_ALARM_SUPPORT)
/** @defgroup RTC_DDL_EF_ALARM  ALARM
  * @{
  */

/**
  * @brief  Set Alarm Counter
  * @note   Bit is write-protected. @ref DDL_RTC_DisableWriteProtection function should be called before.
  * @param  RTCx RTC Instance
  * @param  AlarmCounter Value between Min_Data=0x00 and Max_Data=0xFFFFF
  * @retval None
  */
__STATIC_INLINE void DDL_RTC_ALARM_Set(RTC_TypeDef *RTCx, uint32_t AlarmCounter)
{
  /* Set RTC COUNTER MSB word */
  WRITE_REG(RTCx->ALRH, (AlarmCounter >> 16));
  /* Set RTC COUNTER LSB word */
  WRITE_REG(RTCx->ALRL, (AlarmCounter & RTC_ALRL_ALRL));
}

/**
  * @brief  Get Alarm Counter
  * @note   Bit is write-protected. @ref DDL_RTC_DisableWriteProtection function should be called before.
  * @param  RTCx RTC Instance
  * @retval None
  */
__STATIC_INLINE uint32_t DDL_RTC_ALARM_Get(RTC_TypeDef *RTCx)
{
  register uint16_t high = 0, low = 0;

  high  = READ_REG(RTCx->ALRH & RTC_ALRH_ALRH);
  low   = READ_REG(RTCx->ALRL & RTC_ALRL_ALRL);

  return (((uint32_t) high << 16U) | low);
}

/**
  * @}
  */
#endif /*  */

#if defined (RTC_TIMESTAMP_SUPPORT)
/** @defgroup RTC_DDL_EF_Timestamp Timestamp
  * @{
  */

/**
  * @brief  Enable Timestamp
  * @note   Bit is write-protected. @ref DDL_RTC_DisableWriteProtection function should be called before.
  * @param  RTCx RTC Instance
  * @retval None
  */
__STATIC_INLINE void DDL_RTC_TS_Enable(RTC_TypeDef *RTCx)
{
  SET_BIT(RTCx->CTRL, RTC_CTRL_TSEN);
}

/**
  * @brief  Disable Timestamp
  * @note   Bit is write-protected. @ref DDL_RTC_DisableWriteProtection function should be called before.
  * @param  RTCx RTC Instance
  * @retval None
  */
__STATIC_INLINE void DDL_RTC_TS_Disable(RTC_TypeDef *RTCx)
{
  CLEAR_BIT(RTCx->CTRL, RTC_CTRL_TSEN);
}

/**
  * @brief  Set Time-stamp event active edge
  * @note   Bit is write-protected. @ref DDL_RTC_DisableWriteProtection function should be called before.
  * @note TSE must be reset when TSEDGE is changed to avoid unwanted TSF setting
  * @param  RTCx RTC Instance
  * @param  Edge This parameter can be one of the following values:
  *         @arg @ref DDL_RTC_TIMESTAMP_EDGE_RISING
  *         @arg @ref DDL_RTC_TIMESTAMP_EDGE_FALLING
  * @retval None
  */
__STATIC_INLINE void DDL_RTC_TS_SetActiveEdge(RTC_TypeDef *RTCx, uint32_t Edge)
{
  MODIFY_REG(RTCx->CTRL, RTC_CTRL_TSETECFG, Edge);
}

/**
  * @brief  Get Time-stamp event active edge
  * @note   Bit is write-protected. @ref DDL_RTC_DisableWriteProtection function should be called before.
  * @param  RTCx RTC Instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref DDL_RTC_TIMESTAMP_EDGE_RISING
  *         @arg @ref DDL_RTC_TIMESTAMP_EDGE_FALLING
  */
__STATIC_INLINE uint32_t DDL_RTC_TS_GetActiveEdge(RTC_TypeDef *RTCx)
{
  return (uint32_t)(READ_BIT(RTCx->CTRL, RTC_CTRL_TSETECFG));
}

/**
  * @brief  Get Timestamp AM/PM notation (AM or 24-hour format)
  * @param  RTCx RTC Instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref DDL_RTC_TS_TIME_FORMAT_AM
  *         @arg @ref DDL_RTC_TS_TIME_FORMAT_PM
  */
__STATIC_INLINE uint32_t DDL_RTC_TS_GetTimeFormat(RTC_TypeDef *RTCx)
{
  return (uint32_t)(READ_BIT(RTCx->TSTIME, RTC_TSTIME_TIMEFCFG));
}

/**
  * @brief  Get Timestamp Hours in BCD format
  * @note helper macro __DDL_RTC_CONVERT_BCD2BIN is available to convert Hours from BCD to Binary format
  * @param  RTCx RTC Instance
  * @retval Value between Min_Data=0x01 and Max_Data=0x12 or between Min_Data=0x00 and Max_Data=0x23
  */
__STATIC_INLINE uint32_t DDL_RTC_TS_GetHour(RTC_TypeDef *RTCx)
{
  return (uint32_t)(READ_BIT(RTCx->TSTIME, RTC_TSTIME_HRT | RTC_TSTIME_HRU) >> RTC_TSTIME_HRU_Pos);
}

/**
  * @brief  Get Timestamp Minutes in BCD format
  * @note helper macro __DDL_RTC_CONVERT_BCD2BIN is available to convert Minutes from BCD to Binary format
  * @param  RTCx RTC Instance
  * @retval Value between Min_Data=0x00 and Max_Data=0x59
  */
__STATIC_INLINE uint32_t DDL_RTC_TS_GetMinute(RTC_TypeDef *RTCx)
{
  return (uint32_t)(READ_BIT(RTCx->TSTIME, RTC_TSTIME_MINT | RTC_TSTIME_MINU) >> RTC_TSTIME_MINU_Pos);
}

/**
  * @brief  Get Timestamp Seconds in BCD format
  * @note helper macro __DDL_RTC_CONVERT_BCD2BIN is available to convert Seconds from BCD to Binary format
  * @param  RTCx RTC Instance
  * @retval Value between Min_Data=0x00 and Max_Data=0x59
  */
__STATIC_INLINE uint32_t DDL_RTC_TS_GetSecond(RTC_TypeDef *RTCx)
{
  return (uint32_t)(READ_BIT(RTCx->TSTIME, RTC_TSTIME_SECT | RTC_TSTIME_SECU));
}

/**
  * @brief  Get Timestamp time (hour, minute and second) in BCD format
  * @note helper macros __DDL_RTC_GET_HOUR, __DDL_RTC_GET_MINUTE and __DDL_RTC_GET_SECOND
  * are available to get independently each parameter.
  * @param  RTCx RTC Instance
  * @retval Combination of hours, minutes and seconds.
  */
__STATIC_INLINE uint32_t DDL_RTC_TS_GetTime(RTC_TypeDef *RTCx)
{
  return (uint32_t)(READ_BIT(RTCx->TSTIME,
                             RTC_TSTIME_HRT | RTC_TSTIME_HRU | RTC_TSTIME_MINT | RTC_TSTIME_MINU | RTC_TSTIME_SECT | RTC_TSTIME_SECU));
}

/**
  * @brief  Get Timestamp Week day
  * @param  RTCx RTC Instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref DDL_RTC_WEEKDAY_MONDAY
  *         @arg @ref DDL_RTC_WEEKDAY_TUESDAY
  *         @arg @ref DDL_RTC_WEEKDAY_WEDNESDAY
  *         @arg @ref DDL_RTC_WEEKDAY_THURSDAY
  *         @arg @ref DDL_RTC_WEEKDAY_FRIDAY
  *         @arg @ref DDL_RTC_WEEKDAY_SATURDAY
  *         @arg @ref DDL_RTC_WEEKDAY_SUNDAY
  */
__STATIC_INLINE uint32_t DDL_RTC_TS_GetWeekDay(RTC_TypeDef *RTCx)
{
  return (uint32_t)(READ_BIT(RTCx->TSDATE, RTC_TSDATE_WEEKSEL) >> RTC_TSDATE_WEEKSEL_Pos);
}

/**
  * @brief  Get Timestamp Month in BCD format
  * @note helper macro __DDL_RTC_CONVERT_BCD2BIN is available to convert Month from BCD to Binary format
  * @param  RTCx RTC Instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref DDL_RTC_MONTH_JANUARY
  *         @arg @ref DDL_RTC_MONTH_FEBRUARY
  *         @arg @ref DDL_RTC_MONTH_MARCH
  *         @arg @ref DDL_RTC_MONTH_APRIL
  *         @arg @ref DDL_RTC_MONTH_MAY
  *         @arg @ref DDL_RTC_MONTH_JUNE
  *         @arg @ref DDL_RTC_MONTH_JULY
  *         @arg @ref DDL_RTC_MONTH_AUGUST
  *         @arg @ref DDL_RTC_MONTH_SEPTEMBER
  *         @arg @ref DDL_RTC_MONTH_OCTOBER
  *         @arg @ref DDL_RTC_MONTH_NOVEMBER
  *         @arg @ref DDL_RTC_MONTH_DECEMBER
  */
__STATIC_INLINE uint32_t DDL_RTC_TS_GetMonth(RTC_TypeDef *RTCx)
{
  return (uint32_t)(READ_BIT(RTCx->TSDATE, RTC_TSDATE_MONT | RTC_TSDATE_MONU) >> RTC_TSDATE_MONU_Pos);
}

/**
  * @brief  Get Timestamp Day in BCD format
  * @note helper macro __DDL_RTC_CONVERT_BCD2BIN is available to convert Day from BCD to Binary format
  * @param  RTCx RTC Instance
  * @retval Value between Min_Data=0x01 and Max_Data=0x31
  */
__STATIC_INLINE uint32_t DDL_RTC_TS_GetDay(RTC_TypeDef *RTCx)
{
  return (uint32_t)(READ_BIT(RTCx->TSDATE, RTC_TSDATE_DAYT | RTC_TSDATE_DAYU));
}

/**
  * @brief  Get Timestamp date (WeekDay, Day and Month) in BCD format
  * @note helper macros __DDL_RTC_GET_WEEKDAY, __DDL_RTC_GET_MONTH,
  * and __DDL_RTC_GET_DAY are available to get independently each parameter.
  * @param  RTCx RTC Instance
  * @retval Combination of Weekday, Day and Month
  */
__STATIC_INLINE uint32_t DDL_RTC_TS_GetDate(RTC_TypeDef *RTCx)
{
  return (uint32_t)(READ_BIT(RTCx->TSDATE, RTC_TSDATE_WEEKSEL | RTC_TSDATE_MONT | RTC_TSDATE_MONU | RTC_TSDATE_DAYT | RTC_TSDATE_DAYU));
}

/**
  * @brief  Get time-stamp subseconds value
  * @param  RTCx RTC Instance
  * @retval Value between Min_Data=0x00 and Max_Data=0xFFFF
  */
__STATIC_INLINE uint32_t DDL_RTC_TS_GetSubSecond(RTC_TypeDef *RTCx)
{
  return (uint32_t)(READ_BIT(RTCx->TSSUBSEC, RTC_TSSUBSEC_SUBSE));
}

