betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Include/apm32f4xx_ddl_rtc.h
#if defined(RTC_TACFG_TPTSEN)
/**
  * @brief  Activate timestamp on tamper detection event
  * @param  RTCx RTC Instance
  * @retval None
  */
__STATIC_INLINE void DDL_RTC_TS_EnableOnTamper(RTC_TypeDef *RTCx)
{
  SET_BIT(RTCx->TACFG, RTC_TACFG_TPTSEN);
}

/**
  * @brief  Disable timestamp on tamper detection event
  * @param  RTCx RTC Instance
  * @retval None
  */
__STATIC_INLINE void DDL_RTC_TS_DisableOnTamper(RTC_TypeDef *RTCx)
{
  CLEAR_BIT(RTCx->TACFG, RTC_TACFG_TPTSEN);
}
#endif /* RTC_TACFG_TPTSEN */

/**
  * @brief  Set timestamp Pin
  * @param  RTCx RTC Instance
  * @param  TSPin specifies the RTC Timestamp Pin.
  *          This parameter can be one of the following values:
  *            @arg DDL_RTC_TimeStampPin_Default: RTC_AF1 is used as RTC Timestamp Pin.
  *            @arg DDL_RTC_TimeStampPin_Pos1: RTC_AF2 is used as RTC Timestamp Pin. (*)
  *
  *            (*) value not applicable to all devices.
  * @retval None
  */
__STATIC_INLINE void DDL_RTC_TS_SetPin(RTC_TypeDef *RTCx, uint32_t TSPin)
{
  MODIFY_REG(RTCx->TACFG, RTC_TACFG_TSMSEL, TSPin);
}

/**
  * @brief  Get timestamp Pin
  * @param  RTCx RTC Instance
  * @retval Returned value can be one of the following values:
  *            @arg DDL_RTC_TimeStampPin_Default: RTC_AF1 is used as RTC Timestamp Pin.
  *            @arg DDL_RTC_TimeStampPin_Pos1: RTC_AF2 is used as RTC Timestamp Pin. (*)
  *
  *            (*) value not applicable to all devices.
  * @retval None
  */
__STATIC_INLINE uint32_t DDL_RTC_TS_GetPin(RTC_TypeDef *RTCx)
{
  return (uint32_t)(READ_BIT(RTCx->TACFG, RTC_TACFG_TSMSEL));
}

/**
  * @}
  */
#endif /* RTC_TIMESTAMP_SUPPORT */

/** @defgroup RTC_DDL_EF_Tamper Tamper
  * @{
  */

#if defined (RTC_TAMPER_SUPPORT)
/**
  * @brief  Enable RTC_TAMPx input detection
  * @param  RTCx RTC Instance
  * @param  Tamper This parameter can be a combination of the following values:
  *         @arg @ref DDL_RTC_TAMPER_1
  *         @arg @ref DDL_RTC_TAMPER_2 (*)
  *
  *         (*) value not applicable to all devices.
  * @retval None
  */
__STATIC_INLINE void DDL_RTC_TAMPER_Enable(RTC_TypeDef *RTCx, uint32_t Tamper)
{
  SET_BIT(RTCx->TACFG, Tamper);
}

/**
  * @brief  Clear RTC_TAMPx input detection
  * @param  RTCx RTC Instance
  * @param  Tamper This parameter can be a combination of the following values:
  *         @arg @ref DDL_RTC_TAMPER_1
  *         @arg @ref DDL_RTC_TAMPER_2 (*)
  *
  *         (*) value not applicable to all devices.
  * @retval None
  */
__STATIC_INLINE void DDL_RTC_TAMPER_Disable(RTC_TypeDef *RTCx, uint32_t Tamper)
{
  CLEAR_BIT(RTCx->TACFG, Tamper);
}

/**
  * @brief  Disable RTC_TAMPx pull-up disable (Disable precharge of RTC_TAMPx pins)
  * @param  RTCx RTC Instance
  * @retval None
  */
__STATIC_INLINE void DDL_RTC_TAMPER_DisablePullUp(RTC_TypeDef *RTCx)
{
  SET_BIT(RTCx->TACFG, RTC_TACFG_TPPUDIS);
}

/**
  * @brief  Enable RTC_TAMPx pull-up disable ( Precharge RTC_TAMPx pins before sampling)
  * @param  RTCx RTC Instance
  * @retval None
  */
__STATIC_INLINE void DDL_RTC_TAMPER_EnablePullUp(RTC_TypeDef *RTCx)
{
  CLEAR_BIT(RTCx->TACFG, RTC_TACFG_TPPUDIS);
}

/**
  * @brief  Set RTC_TAMPx precharge duration
  * @param  RTCx RTC Instance
  * @param  Duration This parameter can be one of the following values:
  *         @arg @ref DDL_RTC_TAMPER_DURATION_1RTCCLK
  *         @arg @ref DDL_RTC_TAMPER_DURATION_2RTCCLK
  *         @arg @ref DDL_RTC_TAMPER_DURATION_4RTCCLK
  *         @arg @ref DDL_RTC_TAMPER_DURATION_8RTCCLK
  * @retval None
  */
__STATIC_INLINE void DDL_RTC_TAMPER_SetPrecharge(RTC_TypeDef *RTCx, uint32_t Duration)
{
  MODIFY_REG(RTCx->TACFG, RTC_TACFG_TPPRDUSEL, Duration);
}

/**
  * @brief  Get RTC_TAMPx precharge duration
  * @param  RTCx RTC Instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref DDL_RTC_TAMPER_DURATION_1RTCCLK
  *         @arg @ref DDL_RTC_TAMPER_DURATION_2RTCCLK
  *         @arg @ref DDL_RTC_TAMPER_DURATION_4RTCCLK
  *         @arg @ref DDL_RTC_TAMPER_DURATION_8RTCCLK
  */
__STATIC_INLINE uint32_t DDL_RTC_TAMPER_GetPrecharge(RTC_TypeDef *RTCx)
{
  return (uint32_t)(READ_BIT(RTCx->TACFG, RTC_TACFG_TPPRDUSEL));
}

/**
  * @brief  Set RTC_TAMPx filter count
  * @param  RTCx RTC Instance
  * @param  FilterCount This parameter can be one of the following values:
  *         @arg @ref DDL_RTC_TAMPER_FILTER_DISABLE
  *         @arg @ref DDL_RTC_TAMPER_FILTER_2SAMPLE
  *         @arg @ref DDL_RTC_TAMPER_FILTER_4SAMPLE
  *         @arg @ref DDL_RTC_TAMPER_FILTER_8SAMPLE
  * @retval None
  */
__STATIC_INLINE void DDL_RTC_TAMPER_SetFilterCount(RTC_TypeDef *RTCx, uint32_t FilterCount)
{
  MODIFY_REG(RTCx->TACFG, RTC_TACFG_TPFCSEL, FilterCount);
}

/**
  * @brief  Get RTC_TAMPx filter count
  * @param  RTCx RTC Instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref DDL_RTC_TAMPER_FILTER_DISABLE
  *         @arg @ref DDL_RTC_TAMPER_FILTER_2SAMPLE
  *         @arg @ref DDL_RTC_TAMPER_FILTER_4SAMPLE
  *         @arg @ref DDL_RTC_TAMPER_FILTER_8SAMPLE
  */
__STATIC_INLINE uint32_t DDL_RTC_TAMPER_GetFilterCount(RTC_TypeDef *RTCx)
{
  return (uint32_t)(READ_BIT(RTCx->TACFG, RTC_TACFG_TPFCSEL));
}

/**
  * @brief  Set Tamper sampling frequency
  * @param  RTCx RTC Instance
  * @param  SamplingFreq This parameter can be one of the following values:
  *         @arg @ref DDL_RTC_TAMPER_SAMPLFREQDIV_32768
  *         @arg @ref DDL_RTC_TAMPER_SAMPLFREQDIV_16384
  *         @arg @ref DDL_RTC_TAMPER_SAMPLFREQDIV_8192
  *         @arg @ref DDL_RTC_TAMPER_SAMPLFREQDIV_4096
  *         @arg @ref DDL_RTC_TAMPER_SAMPLFREQDIV_2048
  *         @arg @ref DDL_RTC_TAMPER_SAMPLFREQDIV_1024
  *         @arg @ref DDL_RTC_TAMPER_SAMPLFREQDIV_512
  *         @arg @ref DDL_RTC_TAMPER_SAMPLFREQDIV_256
  * @retval None
  */
__STATIC_INLINE void DDL_RTC_TAMPER_SetSamplingFreq(RTC_TypeDef *RTCx, uint32_t SamplingFreq)
{
  MODIFY_REG(RTCx->TACFG, RTC_TACFG_TPSFSEL, SamplingFreq);
}

/**
  * @brief  Get Tamper sampling frequency
  * @param  RTCx RTC Instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref DDL_RTC_TAMPER_SAMPLFREQDIV_32768
  *         @arg @ref DDL_RTC_TAMPER_SAMPLFREQDIV_16384
  *         @arg @ref DDL_RTC_TAMPER_SAMPLFREQDIV_8192
  *         @arg @ref DDL_RTC_TAMPER_SAMPLFREQDIV_4096
  *         @arg @ref DDL_RTC_TAMPER_SAMPLFREQDIV_2048
  *         @arg @ref DDL_RTC_TAMPER_SAMPLFREQDIV_1024
  *         @arg @ref DDL_RTC_TAMPER_SAMPLFREQDIV_512
  *         @arg @ref DDL_RTC_TAMPER_SAMPLFREQDIV_256
  */
__STATIC_INLINE uint32_t DDL_RTC_TAMPER_GetSamplingFreq(RTC_TypeDef *RTCx)
{
  return (uint32_t)(READ_BIT(RTCx->TACFG, RTC_TACFG_TPSFSEL));
}

/**
  * @brief  Enable Active level for Tamper input
  * @param  RTCx RTC Instance
  * @param  Tamper This parameter can be a combination of the following values:
  *         @arg @ref DDL_RTC_TAMPER_ACTIVELEVEL_TAMP1
  *         @arg @ref DDL_RTC_TAMPER_ACTIVELEVEL_TAMP2 (*)
  *
  *         (*) value not applicable to all devices.
  * @retval None
  */
__STATIC_INLINE void DDL_RTC_TAMPER_EnableActiveLevel(RTC_TypeDef *RTCx, uint32_t Tamper)
{
  SET_BIT(RTCx->TACFG, Tamper);
}

/**
  * @brief  Disable Active level for Tamper input
  * @param  RTCx RTC Instance
  * @param  Tamper This parameter can be a combination of the following values:
  *         @arg @ref DDL_RTC_TAMPER_ACTIVELEVEL_TAMP1
  *         @arg @ref DDL_RTC_TAMPER_ACTIVELEVEL_TAMP2 (*)
  *
  *         (*) value not applicable to all devices.
  * @retval None
  */
__STATIC_INLINE void DDL_RTC_TAMPER_DisableActiveLevel(RTC_TypeDef *RTCx, uint32_t Tamper)
{
  CLEAR_BIT(RTCx->TACFG, Tamper);
}

/**
  * @brief  Set Tamper Pin
  * @param  RTCx RTC Instance
  * @param  TamperPin specifies the RTC Tamper Pin.
  *          This parameter can be one of the following values:
  *            @arg DDL_RTC_TamperPin_Default: RTC_AF1 is used as RTC Tamper Pin.
  *            @arg DDL_RTC_TamperPin_Pos1: RTC_AF2 is used as RTC Tamper Pin. (*)
  *
  *            (*) value not applicable to all devices.
  * @retval None
  */
__STATIC_INLINE void DDL_RTC_TAMPER_SetPin(RTC_TypeDef *RTCx, uint32_t TamperPin)
{
  MODIFY_REG(RTCx->TACFG, RTC_TACFG_TP1MSEL, TamperPin);
}

/**
  * @brief  Get Tamper Pin
  * @param  RTCx RTC Instance
  * @retval Returned value can be one of the following values:
  *            @arg DDL_RTC_TamperPin_Default: RTC_AF1 is used as RTC Tamper Pin.
  *            @arg DDL_RTC_TamperPin_Pos1: RTC_AF2 is selected as RTC Tamper Pin. (*)
  *
  *            (*) value not applicable to all devices.
  * @retval None
  */

__STATIC_INLINE uint32_t DDL_RTC_TAMPER_GetPin(RTC_TypeDef *RTCx)
{
  return (uint32_t)(READ_BIT(RTCx->TACFG, RTC_TACFG_TP1MSEL));
}
#endif /* RTC_TAMPER_SUPPORT */

#if defined (BAKPR)

/**
  * @brief  Enable RTC_TAMPx input detection
  * @retval None
  */
__STATIC_INLINE void DDL_RTC_TAMPER_Enable(BAKPR_TypeDef *BAKPRx)
{
  SET_BIT(BAKPRx->CTRL, BAKPR_CTRL_TPFCFG);
}

/**
  * @brief  Disable RTC_TAMPx Tamper
  * @retval None
  */
__STATIC_INLINE void DDL_RTC_TAMPER_Disable(BAKPR_TypeDef *BAKPRx)
{
  CLEAR_BIT(BAKPRx->CTRL, BAKPR_CTRL_TPFCFG);
}

/**
  * @brief  Enable Active level for Tamper input
  * @param  BAKPRx  BKP Instance
  * @param  Tamper This parameter can be a combination of the following values:
  *         @arg @ref DDL_RTC_TAMPER_ACTIVELEVEL_LOW
  *         @arg @ref DDL_RTC_TAMPER_ACTIVELEVEL_HIGH
  * @retval None
  */
__STATIC_INLINE void DDL_RTC_TAMPER_SetActiveLevel(BAKPR_TypeDef *BAKPRx, uint32_t Tamper)
{
  MODIFY_REG(BAKPRx->CTRL, BAKPR_CTRL_TPALCFG, Tamper);
}

/**
  * @brief  Disable Active level for Tamper input
  * @retval None
  */
__STATIC_INLINE uint32_t DDL_RTC_TAMPER_GetActiveLevel(BAKPR_TypeDef *BAKPRx)
{
  return (uint32_t)(READ_BIT(BAKPRx->CTRL, BAKPR_CTRL_TPALCFG));
}
#endif /* BAKPR */
/**
  * @}
  */

#if defined (RTC_WAKEUP_SUPPORT)
/** @defgroup RTC_DDL_EF_Wakeup Wakeup
  * @{
  */

/**
  * @brief  Enable Wakeup timer
  * @note   Bit is write-protected. @ref DDL_RTC_DisableWriteProtection function should be called before.
  * @param  RTCx RTC Instance
  * @retval None
  */
__STATIC_INLINE void DDL_RTC_WAKEUP_Enable(RTC_TypeDef *RTCx)
{
  SET_BIT(RTCx->CTRL, RTC_CTRL_WUTEN);
}

/**
  * @brief  Disable Wakeup timer
  * @note   Bit is write-protected. @ref DDL_RTC_DisableWriteProtection function should be called before.
  * @param  RTCx RTC Instance
  * @retval None
  */
__STATIC_INLINE void DDL_RTC_WAKEUP_Disable(RTC_TypeDef *RTCx)
{
  CLEAR_BIT(RTCx->CTRL, RTC_CTRL_WUTEN);
}

/**
  * @brief  Check if Wakeup timer is enabled or not
  * @param  RTCx RTC Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t DDL_RTC_WAKEUP_IsEnabled(RTC_TypeDef *RTCx)
{
  return ((READ_BIT(RTCx->CTRL, RTC_CTRL_WUTEN) == (RTC_CTRL_WUTEN)) ? 1UL : 0UL);
}

/**
  * @brief  Select Wakeup clock
  * @note   Bit is write-protected. @ref DDL_RTC_DisableWriteProtection function should be called before.
  * @note   Bit can be written only when RTC_CTRL WUTE bit = 0 and RTC_STS WUTWF bit = 1
  * @param  RTCx RTC Instance
  * @param  WakeupClock This parameter can be one of the following values:
  *         @arg @ref DDL_RTC_WAKEUPCLOCK_DIV_16
  *         @arg @ref DDL_RTC_WAKEUPCLOCK_DIV_8
  *         @arg @ref DDL_RTC_WAKEUPCLOCK_DIV_4
  *         @arg @ref DDL_RTC_WAKEUPCLOCK_DIV_2
  *         @arg @ref DDL_RTC_WAKEUPCLOCK_CKSPRE
  *         @arg @ref DDL_RTC_WAKEUPCLOCK_CKSPRE_WUT
  * @retval None
  */
__STATIC_INLINE void DDL_RTC_WAKEUP_SetClock(RTC_TypeDef *RTCx, uint32_t WakeupClock)
{
  MODIFY_REG(RTCx->CTRL, RTC_CTRL_WUCLKSEL, WakeupClock);
}

/**
  * @brief  Get Wakeup clock
  * @param  RTCx RTC Instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref DDL_RTC_WAKEUPCLOCK_DIV_16
  *         @arg @ref DDL_RTC_WAKEUPCLOCK_DIV_8
  *         @arg @ref DDL_RTC_WAKEUPCLOCK_DIV_4
  *         @arg @ref DDL_RTC_WAKEUPCLOCK_DIV_2
  *         @arg @ref DDL_RTC_WAKEUPCLOCK_CKSPRE
  *         @arg @ref DDL_RTC_WAKEUPCLOCK_CKSPRE_WUT
  */
__STATIC_INLINE uint32_t DDL_RTC_WAKEUP_GetClock(RTC_TypeDef *RTCx)
{
  return (uint32_t)(READ_BIT(RTCx->CTRL, RTC_CTRL_WUCLKSEL));
}

/**
  * @brief  Set Wakeup auto-reload value
  * @note   Bit can be written only when WUTWF is set to 1 in RTC_STS
  * @param  RTCx RTC Instance
  * @param  Value Value between Min_Data=0x00 and Max_Data=0xFFFF
  * @retval None
  */
__STATIC_INLINE void DDL_RTC_WAKEUP_SetAutoReload(RTC_TypeDef *RTCx, uint32_t Value)
{
  MODIFY_REG(RTCx->AUTORLD, RTC_AUTORLD_WUAUTORE, Value);
}

/**
  * @brief  Get Wakeup auto-reload value
  * @param  RTCx RTC Instance
  * @retval Value between Min_Data=0x00 and Max_Data=0xFFFF
  */
__STATIC_INLINE uint32_t DDL_RTC_WAKEUP_GetAutoReload(RTC_TypeDef *RTCx)
{
  return (uint32_t)(READ_BIT(RTCx->AUTORLD, RTC_AUTORLD_WUAUTORE));
}

/**
  * @}
  */
#endif /* RTC_WAKEUP_SUPPORT */

/** @defgroup RTC_DDL_EF_Backup_Registers Backup_Registers
  * @{
  */
#if defined (BAKPR)

/**
  * @brief  Writes a data in a specified RTC Backup data register.
  * @param  BKPx  BKP Instance
  * @param  BackupRegister This parameter can be one of the following values:
  *         @arg @ref DDL_RTC_BKP_DR1
  *         @arg @ref DDL_RTC_BKP_DR2
  *         @arg @ref DDL_RTC_BKP_DR3
  *         @arg @ref DDL_RTC_BKP_DR4
  *         @arg @ref DDL_RTC_BKP_DR5
  *         @arg @ref DDL_RTC_BKP_DR6
  *         @arg @ref DDL_RTC_BKP_DR7
  *         @arg @ref DDL_RTC_BKP_DR8
  *         @arg @ref DDL_RTC_BKP_DR9
  *         @arg @ref DDL_RTC_BKP_DR10
  *         @arg @ref DDL_RTC_BKP_DR11
  *         @arg @ref DDL_RTC_BKP_DR12
  *         @arg @ref DDL_RTC_BKP_DR13
  *         @arg @ref DDL_RTC_BKP_DR14
  *         @arg @ref DDL_RTC_BKP_DR15
  *         @arg @ref DDL_RTC_BKP_DR16
  *         @arg @ref DDL_RTC_BKP_DR17
  *         @arg @ref DDL_RTC_BKP_DR18
  *         @arg @ref DDL_RTC_BKP_DR19
  *         @arg @ref DDL_RTC_BKP_DR20
  *         @arg @ref DDL_RTC_BKP_DR21
  *         @arg @ref DDL_RTC_BKP_DR22
  *         @arg @ref DDL_RTC_BKP_DR23
  *         @arg @ref DDL_RTC_BKP_DR24
  *         @arg @ref DDL_RTC_BKP_DR25
  *         @arg @ref DDL_RTC_BKP_DR26
  *         @arg @ref DDL_RTC_BKP_DR27
  *         @arg @ref DDL_RTC_BKP_DR28
  *         @arg @ref DDL_RTC_BKP_DR29
  *         @arg @ref DDL_RTC_BKP_DR30
  *         @arg @ref DDL_RTC_BKP_DR31
  *         @arg @ref DDL_RTC_BKP_DR32
  *         @arg @ref DDL_RTC_BKP_DR33
  *         @arg @ref DDL_RTC_BKP_DR34
  *         @arg @ref DDL_RTC_BKP_DR35
  *         @arg @ref DDL_RTC_BKP_DR36
  *         @arg @ref DDL_RTC_BKP_DR37
  *         @arg @ref DDL_RTC_BKP_DR38
  *         @arg @ref DDL_RTC_BKP_DR39
  *         @arg @ref DDL_RTC_BKP_DR40
  *         @arg @ref DDL_RTC_BKP_DR41
  *         @arg @ref DDL_RTC_BKP_DR42
  * @param  Data Value between Min_Data=0x00 and Max_Data=0xFFFFFFFF
  * @retval None
  */
__STATIC_INLINE void DDL_RTC_BKP_SetRegister(BAKPR_TypeDef *BKPx, uint32_t BackupRegister, uint32_t Data)
{
  register uint32_t tmp = 0U;

