betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Include/apm32f4xx_ddl_rtc.h
  tmp = (uint32_t)BAKPR_BASE;
  tmp += (BackupRegister * 4U);

  /* Write the specified register */
  *(__IO uint32_t *)tmp = (uint32_t)Data;
}

/**
  * @brief  Reads data from the specified RTC Backup data Register.
  * @param  BKPx BKP Instance
  * @param  BackupRegister This parameter can be one of the following values:
  *         @arg @ref DDL_RTC_BKP_DR1
  *         @arg @ref DDL_RTC_BKP_DR2
  *         @arg @ref DDL_RTC_BKP_DR3
  *         @arg @ref DDL_RTC_BKP_DR4
  *         @arg @ref DDL_RTC_BKP_DR5
  *         @arg @ref DDL_RTC_BKP_DR6
  *         @arg @ref DDL_RTC_BKP_DR7
  *         @arg @ref DDL_RTC_BKP_DR8
  *         @arg @ref DDL_RTC_BKP_DR9
  *         @arg @ref DDL_RTC_BKP_DR10
  *         @arg @ref DDL_RTC_BKP_DR11
  *         @arg @ref DDL_RTC_BKP_DR12
  *         @arg @ref DDL_RTC_BKP_DR13
  *         @arg @ref DDL_RTC_BKP_DR14
  *         @arg @ref DDL_RTC_BKP_DR15
  *         @arg @ref DDL_RTC_BKP_DR16
  *         @arg @ref DDL_RTC_BKP_DR17
  *         @arg @ref DDL_RTC_BKP_DR18
  *         @arg @ref DDL_RTC_BKP_DR19
  *         @arg @ref DDL_RTC_BKP_DR20
  *         @arg @ref DDL_RTC_BKP_DR21
  *         @arg @ref DDL_RTC_BKP_DR22
  *         @arg @ref DDL_RTC_BKP_DR23
  *         @arg @ref DDL_RTC_BKP_DR24
  *         @arg @ref DDL_RTC_BKP_DR25
  *         @arg @ref DDL_RTC_BKP_DR26
  *         @arg @ref DDL_RTC_BKP_DR27
  *         @arg @ref DDL_RTC_BKP_DR28
  *         @arg @ref DDL_RTC_BKP_DR29
  *         @arg @ref DDL_RTC_BKP_DR30
  *         @arg @ref DDL_RTC_BKP_DR31
  *         @arg @ref DDL_RTC_BKP_DR32
  *         @arg @ref DDL_RTC_BKP_DR33
  *         @arg @ref DDL_RTC_BKP_DR34
  *         @arg @ref DDL_RTC_BKP_DR35
  *         @arg @ref DDL_RTC_BKP_DR36
  *         @arg @ref DDL_RTC_BKP_DR37
  *         @arg @ref DDL_RTC_BKP_DR38
  *         @arg @ref DDL_RTC_BKP_DR39
  *         @arg @ref DDL_RTC_BKP_DR40
  *         @arg @ref DDL_RTC_BKP_DR41
  *         @arg @ref DDL_RTC_BKP_DR42
  * @retval Value between Min_Data=0x00 and Max_Data=0xFFFFFFFF
  */
__STATIC_INLINE uint32_t DDL_RTC_BKP_GetRegister(BAKPR_TypeDef *BKPx, uint32_t BackupRegister)
{
  register uint32_t tmp = 0U;

  tmp = (uint32_t)BAKPR_BASE;
  tmp += (BackupRegister * 4U);

  /* Read the specified register */
  return ((*(__IO uint32_t *)tmp) & BAKPR_DATA1_DATA);
}
#else
/**
  * @brief  Writes a data in a specified RTC Backup data register.
  * @param  RTCx RTC Instance
  * @param  BackupRegister This parameter can be one of the following values:
  *         @arg @ref DDL_RTC_BKP_DR0
  *         @arg @ref DDL_RTC_BKP_DR1
  *         @arg @ref DDL_RTC_BKP_DR2
  *         @arg @ref DDL_RTC_BKP_DR3
  *         @arg @ref DDL_RTC_BKP_DR4
  *         @arg @ref DDL_RTC_BKP_DR5
  *         @arg @ref DDL_RTC_BKP_DR6
  *         @arg @ref DDL_RTC_BKP_DR7
  *         @arg @ref DDL_RTC_BKP_DR8
  *         @arg @ref DDL_RTC_BKP_DR9
  *         @arg @ref DDL_RTC_BKP_DR10
  *         @arg @ref DDL_RTC_BKP_DR11
  *         @arg @ref DDL_RTC_BKP_DR12
  *         @arg @ref DDL_RTC_BKP_DR13
  *         @arg @ref DDL_RTC_BKP_DR14
  *         @arg @ref DDL_RTC_BKP_DR15
  *         @arg @ref DDL_RTC_BKP_DR16
  *         @arg @ref DDL_RTC_BKP_DR17
  *         @arg @ref DDL_RTC_BKP_DR18
  *         @arg @ref DDL_RTC_BKP_DR19
  * @param  Data Value between Min_Data=0x00 and Max_Data=0xFFFFFFFF
  * @retval None
  */
__STATIC_INLINE void DDL_RTC_BAK_SetRegister(RTC_TypeDef *RTCx, uint32_t BackupRegister, uint32_t Data)
{
  uint32_t temp;

  temp = (uint32_t)(&(RTCx->BAKP0));
  temp += (BackupRegister * 4U);

  /* Write the specified register */
  *(__IO uint32_t *)temp = (uint32_t)Data;
}

/**
  * @brief  Reads data from the specified RTC Backup data Register.
  * @param  RTCx RTC Instance
  * @param  BackupRegister This parameter can be one of the following values:
  *         @arg @ref DDL_RTC_BKP_DR0
  *         @arg @ref DDL_RTC_BKP_DR1
  *         @arg @ref DDL_RTC_BKP_DR2
  *         @arg @ref DDL_RTC_BKP_DR3
  *         @arg @ref DDL_RTC_BKP_DR4
  *         @arg @ref DDL_RTC_BKP_DR5
  *         @arg @ref DDL_RTC_BKP_DR6
  *         @arg @ref DDL_RTC_BKP_DR7
  *         @arg @ref DDL_RTC_BKP_DR8
  *         @arg @ref DDL_RTC_BKP_DR9
  *         @arg @ref DDL_RTC_BKP_DR10
  *         @arg @ref DDL_RTC_BKP_DR11
  *         @arg @ref DDL_RTC_BKP_DR12
  *         @arg @ref DDL_RTC_BKP_DR13
  *         @arg @ref DDL_RTC_BKP_DR14
  *         @arg @ref DDL_RTC_BKP_DR15
  *         @arg @ref DDL_RTC_BKP_DR16
  *         @arg @ref DDL_RTC_BKP_DR17
  *         @arg @ref DDL_RTC_BKP_DR18
  *         @arg @ref DDL_RTC_BKP_DR19
  * @retval Value between Min_Data=0x00 and Max_Data=0xFFFFFFFF
  */
__STATIC_INLINE uint32_t DDL_RTC_BAK_GetRegister(RTC_TypeDef *RTCx, uint32_t BackupRegister)
{
  uint32_t temp;

  temp = (uint32_t)(&(RTCx->BAKP0));
  temp += (BackupRegister * 4U);

  /* Read the specified register */
  return (*(__IO uint32_t *)temp);
}
#endif /* BAKPR */
/**
  * @}
  */
/** @defgroup RTC_DDL_EF_Calibration Calibration
  * @{
  */

#if defined (RTC_CALIBRATION_SUPPORT)
/**
  * @brief  Set Calibration output frequency (1 Hz or 512 Hz)
  * @note Bits are write-protected. @ref DDL_RTC_DisableWriteProtection function should be called before.
  * @param  RTCx RTC Instance
  * @param  Frequency This parameter can be one of the following values:
  *         @arg @ref DDL_RTC_CALIB_OUTPUT_NONE
  *         @arg @ref DDL_RTC_CALIB_OUTPUT_1HZ
  *         @arg @ref DDL_RTC_CALIB_OUTPUT_512HZ
  *
  * @retval None
  */
__STATIC_INLINE void DDL_RTC_CAL_SetOutputFreq(RTC_TypeDef *RTCx, uint32_t Frequency)
{
  MODIFY_REG(RTCx->CTRL, RTC_CTRL_CALOEN | RTC_CTRL_CALOSEL, Frequency);
}

/**
  * @brief  Get Calibration output frequency (1 Hz or 512 Hz)
  * @param  RTCx RTC Instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref DDL_RTC_CALIB_OUTPUT_NONE
  *         @arg @ref DDL_RTC_CALIB_OUTPUT_1HZ
  *         @arg @ref DDL_RTC_CALIB_OUTPUT_512HZ
  *
  */
__STATIC_INLINE uint32_t DDL_RTC_CAL_GetOutputFreq(RTC_TypeDef *RTCx)
{
  return (uint32_t)(READ_BIT(RTCx->CTRL, RTC_CTRL_CALOEN | RTC_CTRL_CALOSEL));
}

/**
  * @brief  Enable Coarse digital calibration
  * @note   Bit is write-protected. @ref DDL_RTC_DisableWriteProtection function should be called before.
  * @note   It can be written in initialization mode only (@ref DDL_RTC_EnableInitMode function)
  * @param  RTCx RTC Instance
  * @retval None
  */
__STATIC_INLINE void DDL_RTC_CAL_EnableCoarseDigital(RTC_TypeDef *RTCx)
{
  SET_BIT(RTCx->CTRL, RTC_CTRL_DCALEN);
}

/**
  * @brief  Disable Coarse digital calibration
  * @note   Bit is write-protected. @ref DDL_RTC_DisableWriteProtection function should be called before.
  * @note   It can be written in initialization mode only (@ref DDL_RTC_EnableInitMode function)
  * @param  RTCx RTC Instance
  * @retval None
  */
__STATIC_INLINE void DDL_RTC_CAL_DisableCoarseDigital(RTC_TypeDef  *RTCx)
{
  CLEAR_BIT(RTCx->CTRL, RTC_CTRL_DCALEN);
}

/**
  * @brief  Set the coarse digital calibration
  * @note   Bit is write-protected. @ref DDL_RTC_DisableWriteProtection function should be called before.
  * @note   It can be written in initialization mode only (@ref DDL_RTC_EnableInitMode function)
  * @param  RTCx RTC Instance
  * @param  Sign This parameter can be one of the following values:
  *         @arg @ref DDL_RTC_CALIB_SIGN_POSITIVE
  *         @arg @ref DDL_RTC_CALIB_SIGN_NEGATIVE
  * @param  Value value of coarse calibration expressed in ppm (coded on 5 bits)
  * @note   This Calibration value should be between 0 and 63 when using negative sign with a 2-ppm step.
  * @note   This Calibration value should be between 0 and 126 when using positive sign with a 4-ppm step.
  * @retval None
  */
__STATIC_INLINE void DDL_RTC_CAL_ConfigCoarseDigital(RTC_TypeDef *RTCx, uint32_t Sign, uint32_t Value)
{
  MODIFY_REG(RTCx->DCAL, RTC_DCAL_DCALCFG | RTC_DCAL_DCAL, Sign | Value);
}

/**
  * @brief  Get the coarse digital calibration value
  * @param  RTCx RTC Instance
  * @retval value of coarse calibration expressed in ppm (coded on 5 bits)
  */
__STATIC_INLINE uint32_t DDL_RTC_CAL_GetCoarseDigitalValue(RTC_TypeDef *RTCx)
{
  return (uint32_t)(READ_BIT(RTCx->DCAL, RTC_DCAL_DCAL));
}

/**
  * @brief  Get the coarse digital calibration sign
  * @param  RTCx RTC Instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref DDL_RTC_CALIB_SIGN_POSITIVE
  *         @arg @ref DDL_RTC_CALIB_SIGN_NEGATIVE
  */
__STATIC_INLINE uint32_t DDL_RTC_CAL_GetCoarseDigitalSign(RTC_TypeDef *RTCx)
{
  return (uint32_t)(READ_BIT(RTCx->DCAL, RTC_DCAL_DCALCFG));
}

/**
  * @brief  Insert or not One RTCCLK pulse every 2exp11 pulses (frequency increased by 488.5 ppm)
  * @note   Bit is write-protected. @ref DDL_RTC_DisableWriteProtection function should be called before.
  * @note   Bit can be written only when RECALPF is set to 0 in RTC_STS
  * @param  RTCx RTC Instance
  * @param  Pulse This parameter can be one of the following values:
  *         @arg @ref DDL_RTC_CALIB_INSERTPULSE_NONE
  *         @arg @ref DDL_RTC_CALIB_INSERTPULSE_SET
  * @retval None
  */
__STATIC_INLINE void DDL_RTC_CAL_SetPulse(RTC_TypeDef *RTCx, uint32_t Pulse)
{
  MODIFY_REG(RTCx->CAL, RTC_CAL_ICALFEN, Pulse);
}

/**
  * @brief  Check if one RTCCLK has been inserted or not every 2exp11 pulses (frequency increased by 488.5 ppm)
  * @param  RTCx RTC Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t DDL_RTC_CAL_IsPulseInserted(RTC_TypeDef *RTCx)
{
  return ((READ_BIT(RTCx->CAL, RTC_CAL_ICALFEN) == (RTC_CAL_ICALFEN)) ? 1UL : 0UL);
}

/**
  * @brief  Set smooth calibration cycle period
  * @note   Bit is write-protected. @ref DDL_RTC_DisableWriteProtection function should be called before.
  * @note   Bit can be written only when RECALPF is set to 0 in RTC_STS
  * @param  RTCx RTC Instance
  * @param  Period This parameter can be one of the following values:
  *         @arg @ref DDL_RTC_CALIB_PERIOD_32SEC
  *         @arg @ref DDL_RTC_CALIB_PERIOD_16SEC
  *         @arg @ref DDL_RTC_CALIB_PERIOD_8SEC
  * @retval None
  */
__STATIC_INLINE void DDL_RTC_CAL_SetPeriod(RTC_TypeDef *RTCx, uint32_t Period)
{
  MODIFY_REG(RTCx->CAL, RTC_CAL_CAL8CFG | RTC_CAL_CAL16CFG, Period);
}

/**
  * @brief  Get smooth calibration cycle period
  * @param  RTCx RTC Instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref DDL_RTC_CALIB_PERIOD_32SEC
  *         @arg @ref DDL_RTC_CALIB_PERIOD_16SEC
  *         @arg @ref DDL_RTC_CALIB_PERIOD_8SEC
  */
__STATIC_INLINE uint32_t DDL_RTC_CAL_GetPeriod(RTC_TypeDef *RTCx)
{
  return (uint32_t)(READ_BIT(RTCx->CAL, RTC_CAL_CAL8CFG | RTC_CAL_CAL16CFG));
}

/**
  * @brief  Set smooth Calibration minus
  * @note   Bit is write-protected. @ref DDL_RTC_DisableWriteProtection function should be called before.
  * @note   Bit can be written only when RECALPF is set to 0 in RTC_STS
  * @param  RTCx RTC Instance
  * @param  CalibMinus Value between Min_Data=0x00 and Max_Data=0x1FF
  * @retval None
  */
__STATIC_INLINE void DDL_RTC_CAL_SetMinus(RTC_TypeDef *RTCx, uint32_t CalibMinus)
{
  MODIFY_REG(RTCx->CAL, RTC_CAL_RECALF, CalibMinus);
}

/**
  * @brief  Get smooth Calibration minus
  * @param  RTCx RTC Instance
  * @retval Value between Min_Data=0x00 and Max_Data= 0x1FF
  */
__STATIC_INLINE uint32_t DDL_RTC_CAL_GetMinus(RTC_TypeDef *RTCx)
{
  return (uint32_t)(READ_BIT(RTCx->CAL, RTC_CAL_RECALF));
}
#endif /* RTC_CALIBRATION_SUPPORT */

#if defined (BAKPR_CLKCAL_CALVALUE)
/**
  * @brief  Set the coarse digital calibration
  * @note   Bit is write-protected. @ref DDL_RTC_DisableWriteProtection function should be called before.
  * @note   It can be written in initialization mode only (@ref DDL_RTC_EnterInitMode function)
  * @param  BKPx RTC Instance
  * @param  Value value of coarse calibration expressed in ppm (coded on 5 bits)
  * @note   This Calibration value should be between 0 and 121 when using positive sign with a 4-ppm step.
  * @retval None
  */
__STATIC_INLINE void DDL_RTC_CAL_SetCoarseDigital(BAKPR_TypeDef *BAKPRx, uint32_t Value)
{
  MODIFY_REG(BAKPRx->CLKCAL, BAKPR_CLKCAL_CALVALUE, Value);
}

/**
  * @brief  Get the coarse digital calibration value
  * @param  BKPx BKP Instance
  * @retval value of coarse calibration expressed in ppm (coded on 5 bits)
  */
__STATIC_INLINE uint32_t DDL_RTC_CAL_GetCoarseDigital(BAKPR_TypeDef *BAKPRx)
{
  return (uint32_t)(READ_BIT(BAKPRx->CLKCAL, BAKPR_CLKCAL_CALVALUE));
}
#endif /* BAKPR_CLKCAL_CALVALUE */
/**
  * @}
  */

/** @defgroup RTC_DDL_EF_FLAG_Management FLAG_Management
  * @{
  */
#if defined (RTC_STS_RCALPFLG)
/**
  * @brief  Get Recalibration pending Flag
  * @param  RTCx RTC Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t DDL_RTC_IsActiveFlag_RECALP(RTC_TypeDef *RTCx)
{
  return ((READ_BIT(RTCx->STS, RTC_STS_RCALPFLG) == (RTC_STS_RCALPFLG)) ? 1UL : 0UL);
}
#endif /* RTC_STS_RCALPFLG */

#if defined(RTC_TAMPER2_SUPPORT)
/**
  * @brief  Get RTC_TAMP2 detection flag
  * @param  RTCx RTC Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t DDL_RTC_IsActiveFlag_TAMP2(RTC_TypeDef *RTCx)
{
  return ((READ_BIT(RTCx->STS, RTC_STS_TP2FLG) == (RTC_STS_TP2FLG)) ? 1UL : 0UL);
}

/**
  * @brief  Clear RTC_TAMP2 detection flag
  * @param  RTCx RTC Instance
  * @retval None
  */
__STATIC_INLINE void DDL_RTC_ClearFlag_TAMP2(RTC_TypeDef *RTCx)
{
  WRITE_REG(RTCx->STS, (~((RTC_STS_TP2FLG | RTC_STS_INITEN) & 0x0000FFFFU) | (RTCx->STS & RTC_STS_INITEN)));
}
#endif /* RTC_TAMPER2_SUPPORT */

