betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Include/apm32f4xx_ddl_rtc.h
#if defined (RTC_STS_TP1FLG)
/**
  * @brief  Get RTC_TAMP1 detection flag
  * @param  RTCx RTC Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t DDL_RTC_IsActiveFlag_TAMP1(RTC_TypeDef *RTCx)
{
  return ((READ_BIT(RTCx->STS, RTC_STS_TP1FLG) == (RTC_STS_TP1FLG)) ? 1UL : 0UL);
}

/**
  * @brief  Clear RTC_TAMP1 detection flag
  * @param  RTCx RTC Instance
  * @retval None
  */
__STATIC_INLINE void DDL_RTC_ClearFlag_TAMP1(RTC_TypeDef *RTCx)
{
  WRITE_REG(RTCx->STS, (~((RTC_STS_TP1FLG | RTC_STS_INITEN) & 0x0000FFFFU) | (RTCx->STS & RTC_STS_INITEN)));
}
#endif /* RTC_STS_TP1FLG */

#if defined (RTC_STS_TSOVRFLG)
/**
  * @brief  Get Time-stamp overflow flag
  * @param  RTCx RTC Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t DDL_RTC_IsActiveFlag_TSOV(RTC_TypeDef *RTCx)
{
  return ((READ_BIT(RTCx->STS, RTC_STS_TSOVRFLG) == (RTC_STS_TSOVRFLG)) ? 1UL : 0UL);
}

/**
  * @brief  Clear Time-stamp overflow flag
  * @param  RTCx RTC Instance
  * @retval None
  */
__STATIC_INLINE void DDL_RTC_ClearFlag_TSOV(RTC_TypeDef *RTCx)
{
  WRITE_REG(RTCx->STS, (~((RTC_STS_TSOVRFLG | RTC_STS_INITEN) & 0x0000FFFFU) | (RTCx->STS & RTC_STS_INITEN)));
}
#endif /* RTC_STS_TSOVRFLG */

#if defined (RTC_STS_TSFLG)
/**
  * @brief  Get Time-stamp flag
  * @param  RTCx RTC Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t DDL_RTC_IsActiveFlag_TS(RTC_TypeDef *RTCx)
{
  return ((READ_BIT(RTCx->STS, RTC_STS_TSFLG) == (RTC_STS_TSFLG)) ? 1UL : 0UL);
}

/**
  * @brief  Clear Time-stamp flag
  * @param  RTCx RTC Instance
  * @retval None
  */
__STATIC_INLINE void DDL_RTC_ClearFlag_TS(RTC_TypeDef *RTCx)
{
  WRITE_REG(RTCx->STS, (~((RTC_STS_TSFLG | RTC_STS_INITEN) & 0x0000FFFFU) | (RTCx->STS & RTC_STS_INITEN)));
}
#endif /* RTC_STS_TSFLG */

#if defined (RTC_STS_WUTFLG)
/**
  * @brief  Get Wakeup timer flag
  * @param  RTCx RTC Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t DDL_RTC_IsActiveFlag_WUT(RTC_TypeDef *RTCx)
{
  return ((READ_BIT(RTCx->STS, RTC_STS_WUTFLG) == (RTC_STS_WUTFLG)) ? 1UL : 0UL);
}

/**
  * @brief  Clear Wakeup timer flag
  * @param  RTCx RTC Instance
  * @retval None
  */
__STATIC_INLINE void DDL_RTC_ClearFlag_WUT(RTC_TypeDef *RTCx)
{
  WRITE_REG(RTCx->STS, (~((RTC_STS_WUTFLG | RTC_STS_INITEN) & 0x0000FFFFU) | (RTCx->STS & RTC_STS_INITEN)));
}
#endif /* RTC_STS_WUTFLG */

#if defined (RTC_STS_ALRBFLG)
/**
  * @brief  Get Alarm B flag
  * @param  RTCx RTC Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t DDL_RTC_IsActiveFlag_ALRB(RTC_TypeDef *RTCx)
{
  return ((READ_BIT(RTCx->STS, RTC_STS_ALRBFLG) == (RTC_STS_ALRBFLG)) ? 1UL : 0UL);
}

/**
  * @brief  Clear Alarm B flag
  * @param  RTCx RTC Instance
  * @retval None
  */
__STATIC_INLINE void DDL_RTC_ClearFlag_ALRB(RTC_TypeDef *RTCx)
{
  WRITE_REG(RTCx->STS, (~((RTC_STS_ALRBFLG | RTC_STS_INITEN) & 0x0000FFFFU) | (RTCx->STS & RTC_STS_INITEN)));
}
#endif /* RTC_STS_ALRBFLG */

#if defined (RTC_STS_ALRAFLG)
/**
  * @brief  Get Alarm A flag
  * @param  RTCx RTC Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t DDL_RTC_IsActiveFlag_ALRA(RTC_TypeDef *RTCx)
{
  return ((READ_BIT(RTCx->STS, RTC_STS_ALRAFLG) == (RTC_STS_ALRAFLG)) ? 1UL : 0UL);
}

/**
  * @brief  Clear Alarm A flag
  * @param  RTCx RTC Instance
  * @retval None
  */
__STATIC_INLINE void DDL_RTC_ClearFlag_ALRA(RTC_TypeDef *RTCx)
{
  WRITE_REG(RTCx->STS, (~((RTC_STS_ALRAFLG | RTC_STS_INITEN) & 0x0000FFFFU) | (RTCx->STS & RTC_STS_INITEN)));
}
#endif /* RTC_STS_ALRAFLG */

#if defined (RTC_STS_RINITFLG)
/**
  * @brief  Get Initialization flag
  * @param  RTCx RTC Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t DDL_RTC_IsActiveFlag_INIT(RTC_TypeDef *RTCx)
{
  return ((READ_BIT(RTCx->STS, RTC_STS_RINITFLG) == (RTC_STS_RINITFLG)) ? 1UL : 0UL);
}
#endif /* RTC_STS_RINITFLG */

#if defined (RTC_STS_RSFLG)
/**
  * @brief  Get Registers synchronization flag
  * @param  RTCx RTC Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t DDL_RTC_IsActiveFlag_RS(RTC_TypeDef *RTCx)
{
  return ((READ_BIT(RTCx->STS, RTC_STS_RSFLG) == (RTC_STS_RSFLG)) ? 1UL : 0UL);
}

/**
  * @brief  Clear Registers synchronization flag
  * @param  RTCx RTC Instance
  * @retval None
  */
__STATIC_INLINE void DDL_RTC_ClearFlag_RS(RTC_TypeDef *RTCx)
{
  WRITE_REG(RTCx->STS, (~((RTC_STS_RSFLG | RTC_STS_INITEN) & 0x0000FFFFU) | (RTCx->STS & RTC_STS_INITEN)));
}
#endif /* RTC_STS_RSFLG */

#if defined (RTC_STS_INITSFLG)
/**
  * @brief  Get Initialization status flag
  * @param  RTCx RTC Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t DDL_RTC_IsActiveFlag_INITS(RTC_TypeDef *RTCx)
{
  return ((READ_BIT(RTCx->STS, RTC_STS_INITSFLG) == (RTC_STS_INITSFLG)) ? 1UL : 0UL);
}
#endif /* RTC_STS_INITSFLG */

#if defined (RTC_STS_SOPFLG)
/**
  * @brief  Get Shift operation pending flag
  * @param  RTCx RTC Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t DDL_RTC_IsActiveFlag_SHP(RTC_TypeDef *RTCx)
{
  return ((READ_BIT(RTCx->STS, RTC_STS_SOPFLG) == (RTC_STS_SOPFLG)) ? 1UL : 0UL);
}
#endif /* RTC_STS_SOPFLG */

#if defined (RTC_STS_WUTWFLG)
/**
  * @brief  Get Wakeup timer write flag
  * @param  RTCx RTC Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t DDL_RTC_IsActiveFlag_WUTW(RTC_TypeDef *RTCx)
{
  return ((READ_BIT(RTCx->STS, RTC_STS_WUTWFLG) == (RTC_STS_WUTWFLG)) ? 1UL : 0UL);
}
#endif /* RTC_STS_WUTWFLG */

#if defined (RTC_STS_ALRBWFLG)
/**
  * @brief  Get Alarm B write flag
  * @param  RTCx RTC Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t DDL_RTC_IsActiveFlag_ALRBW(RTC_TypeDef *RTCx)
{
  return ((READ_BIT(RTCx->STS, RTC_STS_ALRBWFLG) == (RTC_STS_ALRBWFLG)) ? 1UL : 0UL);
}
#endif /* RTC_STS_ALRBWFLG */

#if defined (RTC_STS_ALRAWFLG)
/**
  * @brief  Get Alarm A write flag
  * @param  RTCx RTC Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t DDL_RTC_IsActiveFlag_ALRAW(RTC_TypeDef *RTCx)
{
  return ((READ_BIT(RTCx->STS, RTC_STS_ALRAWFLG) == (RTC_STS_ALRAWFLG)) ? 1UL : 0UL);
}
#endif /* RTC_STS_ALRAWFLG */

#if defined (BAKPR)
/**
  * @brief  Get RTC_TAMPI  Interruption detection flag
  * @param  BAKPRx BAKPR Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t DDL_RTC_IsActiveFlag_TAMPI(BAKPR_TypeDef *BAKPRx)
{
  return (READ_BIT(BAKPRx->CSTS, BAKPR_CSTS_TIFLG) == (BAKPR_CSTS_TIFLG));
}

/**
  * @brief  Clear RTC_TAMPI Interruption detection flag
  * @param  BAKPRx BAKPR Instance
  * @retval None
  */
__STATIC_INLINE void DDL_RTC_ClearFlag_TAMPI(BAKPR_TypeDef *BAKPRx)
{
  SET_BIT(BAKPRx->CSTS, BAKPR_CSTS_TICLR);
}

/**
  * @brief  Get RTC_TAMPE  Event detection flag
  * @param  BAKPRx BAKPR Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t DDL_RTC_IsActiveFlag_TAMPE(BAKPR_TypeDef *BAKPRx)
{
  return (READ_BIT(BAKPRx->CSTS, BAKPR_CSTS_TEFLG) == (BAKPR_CSTS_TEFLG));
}

/**
  * @brief  Clear RTC_TAMPE Even detection flag
  * @param  BAKPRx BAKPR Instance
  * @retval None
  */
__STATIC_INLINE void DDL_RTC_ClearFlag_TAMPE(BAKPR_TypeDef *BAKPRx)
{
  SET_BIT(BAKPRx->CSTS, BAKPR_CSTS_TECLR);
}
#endif /* BAKPR */

#if defined (RTC_CSTS_ALRFLG)
/**
  * @brief  Get Alarm  flag
  * @param  RTCx RTC Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t DDL_RTC_IsActiveFlag_ALR(RTC_TypeDef *RTCx)
{
  return (READ_BIT(RTCx->CSTS, RTC_CSTS_ALRFLG) == (RTC_CSTS_ALRFLG));
}

/**
  * @brief  Clear Alarm flag
  * @param  RTCx RTC Instance
  * @retval None
  */
__STATIC_INLINE void DDL_RTC_ClearFlag_ALR(RTC_TypeDef *RTCx)
{
  CLEAR_BIT(RTCx->CSTS, RTC_CSTS_ALRFLG);
}
#endif /* RTC_CSTS_ALRFLG */

