betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Include/apm32f4xx_ddl_rtc.h
#if defined (RTC_CSTS_RSYNCFLG)
/**
  * @brief  Get Registers synchronization flag
  * @param  RTCx RTC Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t DDL_RTC_IsActiveFlag_RS(RTC_TypeDef *RTCx)
{
  return (READ_BIT(RTCx->CSTS, RTC_CSTS_RSYNCFLG) == (RTC_CSTS_RSYNCFLG));
}

/**
  * @brief  Clear Registers synchronization flag
  * @param  RTCx RTC Instance
  * @retval None
  */
__STATIC_INLINE void DDL_RTC_ClearFlag_RS(RTC_TypeDef *RTCx)
{
  CLEAR_BIT(RTCx->CSTS, RTC_CSTS_RSYNCFLG);
}
#endif /* RTC_CSTS_RSYNCFLG */

#if defined (RTC_CSTS_OVRFLG)
/**
  * @brief  Get Registers OverFlow flag
  * @param  RTCx RTC Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t DDL_RTC_IsActiveFlag_OW(RTC_TypeDef *RTCx)
{
  return (READ_BIT(RTCx->CSTS, RTC_CSTS_OVRFLG) == (RTC_CSTS_OVRFLG));
}

/**
  * @brief  Clear Registers OverFlow flag
  * @param  RTCx RTC Instance
  * @retval None
  */
__STATIC_INLINE void DDL_RTC_ClearFlag_OW(RTC_TypeDef *RTCx)
{
  CLEAR_BIT(RTCx->CSTS, RTC_CSTS_OVRFLG);
}
#endif /* RTC_CSTS_OVRFLG */

#if defined (RTC_CSTS_SECFLG)
/**
  * @brief  Get Registers synchronization flag
  * @param  RTCx RTC Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t DDL_RTC_IsActiveFlag_SEC(RTC_TypeDef *RTCx)
{
  return (READ_BIT(RTCx->CSTS, RTC_CSTS_SECFLG) == (RTC_CSTS_SECFLG));
}

/**
  * @brief  Clear Registers synchronization flag
  * @param  RTCx RTC Instance
  * @retval None
  */
__STATIC_INLINE void DDL_RTC_ClearFlag_SEC(RTC_TypeDef *RTCx)
{
  CLEAR_BIT(RTCx->CSTS, RTC_CSTS_SECFLG);
}
#endif /* RTC_CSTS_SECFLG */

#if defined (RTC_CSTS_OCFLG)
/**
  * @brief  Get RTC Operation OFF status flag
  * @param  RTCx RTC Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t DDL_RTC_IsActiveFlag_RTOF(RTC_TypeDef *RTCx)
{
  return (READ_BIT(RTCx->CSTS, RTC_CSTS_OCFLG) == (RTC_CSTS_OCFLG));
}
#endif /* RTC_CSTS_OCFLG */
/**
  * @}
  */

/** @defgroup RTC_DDL_EF_IT_Management IT_Management
  * @{
  */
#if defined (RTC_CTRL_TSIEN)
/**
  * @brief  Enable Time-stamp interrupt
  * @note   Bit is write-protected. @ref DDL_RTC_DisableWriteProtection function should be called before.
  * @param  RTCx RTC Instance
  * @retval None
  */
__STATIC_INLINE void DDL_RTC_EnableIT_TS(RTC_TypeDef *RTCx)
{
  SET_BIT(RTCx->CTRL, RTC_CTRL_TSIEN);
}

/**
  * @brief  Disable Time-stamp interrupt
  * @note   Bit is write-protected. @ref DDL_RTC_DisableWriteProtection function should be called before.
  * @param  RTCx RTC Instance
  * @retval None
  */
__STATIC_INLINE void DDL_RTC_DisableIT_TS(RTC_TypeDef *RTCx)
{
  CLEAR_BIT(RTCx->CTRL, RTC_CTRL_TSIEN);
}

/**
  * @brief  Check if  Time-stamp interrupt is enabled or not
  * @param  RTCx RTC Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t DDL_RTC_IsEnabledIT_TS(RTC_TypeDef *RTCx)
{
  return ((READ_BIT(RTCx->CTRL, RTC_CTRL_TSIEN) == (RTC_CTRL_TSIEN)) ? 1UL : 0UL);
}
#endif /* RTC_CTRL_TSIEN */

#if defined (RTC_CTRL_WUTIEN)
/**
  * @brief  Enable Wakeup timer interrupt
  * @note   Bit is write-protected. @ref DDL_RTC_DisableWriteProtection function should be called before.
  * @param  RTCx RTC Instance
  * @retval None
  */
__STATIC_INLINE void DDL_RTC_EnableIT_WUT(RTC_TypeDef *RTCx)
{
  SET_BIT(RTCx->CTRL, RTC_CTRL_WUTIEN);
}

/**
  * @brief  Disable Wakeup timer interrupt
  * @note   Bit is write-protected. @ref DDL_RTC_DisableWriteProtection function should be called before.
  * @param  RTCx RTC Instance
  * @retval None
  */
__STATIC_INLINE void DDL_RTC_DisableIT_WUT(RTC_TypeDef *RTCx)
{
  CLEAR_BIT(RTCx->CTRL, RTC_CTRL_WUTIEN);
}

/**
  * @brief  Check if  Wakeup timer interrupt is enabled or not
  * @param  RTCx RTC Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t DDL_RTC_IsEnabledIT_WUT(RTC_TypeDef *RTCx)
{
  return ((READ_BIT(RTCx->CTRL, RTC_CTRL_WUTIEN) == (RTC_CTRL_WUTIEN)) ? 1UL : 0UL);
}
#endif /* RTC_CTRL_WUTIEN */

#if defined (RTC_CTRL_ALRBIEN)
/**
  * @brief  Enable Alarm B interrupt
  * @note   Bit is write-protected. @ref DDL_RTC_DisableWriteProtection function should be called before.
  * @param  RTCx RTC Instance
  * @retval None
  */
__STATIC_INLINE void DDL_RTC_EnableIT_ALRB(RTC_TypeDef *RTCx)
{
  SET_BIT(RTCx->CTRL, RTC_CTRL_ALRBIEN);
}

/**
  * @brief  Disable Alarm B interrupt
  * @note   Bit is write-protected. @ref DDL_RTC_DisableWriteProtection function should be called before.
  * @param  RTCx RTC Instance
  * @retval None
  */
__STATIC_INLINE void DDL_RTC_DisableIT_ALRB(RTC_TypeDef *RTCx)
{
  CLEAR_BIT(RTCx->CTRL, RTC_CTRL_ALRBIEN);
}

/**
  * @brief  Check if  Alarm B interrupt is enabled or not
  * @param  RTCx RTC Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t DDL_RTC_IsEnabledIT_ALRB(RTC_TypeDef *RTCx)
{
  return ((READ_BIT(RTCx->CTRL, RTC_CTRL_ALRBIEN) == (RTC_CTRL_ALRBIEN)) ? 1UL : 0UL);
}
#endif /* RTC_CTRL_ALRBIEN */

#if defined (RTC_CTRL_ALRAIEN)
/**
  * @brief  Enable Alarm A interrupt
  * @note   Bit is write-protected. @ref DDL_RTC_DisableWriteProtection function should be called before.
  * @param  RTCx RTC Instance
  * @retval None
  */
__STATIC_INLINE void DDL_RTC_EnableIT_ALRA(RTC_TypeDef *RTCx)
{
  SET_BIT(RTCx->CTRL, RTC_CTRL_ALRAIEN);
}

/**
  * @brief  Disable Alarm A interrupt
  * @note   Bit is write-protected. @ref DDL_RTC_DisableWriteProtection function should be called before.
  * @param  RTCx RTC Instance
  * @retval None
  */
__STATIC_INLINE void DDL_RTC_DisableIT_ALRA(RTC_TypeDef *RTCx)
{
  CLEAR_BIT(RTCx->CTRL, RTC_CTRL_ALRAIEN);
}

/**
  * @brief  Check if  Alarm A interrupt is enabled or not
  * @param  RTCx RTC Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t DDL_RTC_IsEnabledIT_ALRA(RTC_TypeDef *RTCx)
{
  return ((READ_BIT(RTCx->CTRL, RTC_CTRL_ALRAIEN) == (RTC_CTRL_ALRAIEN)) ? 1UL : 0UL);
}
#endif /* RTC_CTRL_ALRAIEN */

#if defined (RTC_TACFG_TPIEN)
/**
  * @brief  Enable all Tamper Interrupt
  * @param  RTCx RTC Instance
  * @retval None
  */
__STATIC_INLINE void DDL_RTC_EnableIT_TAMP(RTC_TypeDef *RTCx)
{
  SET_BIT(RTCx->TACFG, RTC_TACFG_TPIEN);
}

/**
  * @brief  Disable all Tamper Interrupt
  * @param  RTCx RTC Instance
  * @retval None
  */
__STATIC_INLINE void DDL_RTC_DisableIT_TAMP(RTC_TypeDef *RTCx)
{
  CLEAR_BIT(RTCx->TACFG, RTC_TACFG_TPIEN);
}

/**
  * @brief  Check if all the TAMPER interrupts are enabled or not
  * @param  RTCx RTC Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t DDL_RTC_IsEnabledIT_TAMP(RTC_TypeDef *RTCx)
{
  return ((READ_BIT(RTCx->TACFG,
                    RTC_TACFG_TPIEN) == (RTC_TACFG_TPIEN)) ? 1UL : 0UL);
}
#endif /* RTC_TACFG_TPIEN */

#if defined (RTC_CTRL_ALRIEN)
/**
  * @brief  Enable Alarm  interrupt
  * @param  RTCx RTC Instance
  * @retval None
  */
__STATIC_INLINE void DDL_RTC_EnableIT_ALR(RTC_TypeDef *RTCx)
{
  SET_BIT(RTCx->CTRL, RTC_CTRL_ALRIEN);
}

/**
  * @brief  Disable Alarm  interrupt
  * @param  RTCx RTC Instance
  * @retval None
  */
__STATIC_INLINE void DDL_RTC_DisableIT_ALR(RTC_TypeDef *RTCx)
{
  CLEAR_BIT(RTCx->CTRL, RTC_CTRL_ALRIEN);
}

/**
  * @brief  Check if  Alarm  interrupt is enabled or not
  * @param  RTCx RTC Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t DDL_RTC_IsEnabledIT_ALR(RTC_TypeDef *RTCx)
{
  return (READ_BIT(RTCx->CTRL, RTC_CTRL_ALRIEN) == (RTC_CTRL_ALRIEN));
}
#endif /* RTC_CTRL_ALRIEN */

#if defined (RTC_CTRL_SECIEN)
/**
  * @brief  Enable Second Interrupt interrupt
  * @note   Bit is write-protected. @ref LL_RTC_DisableWriteProtection function should be called before.
  * @param  RTCx RTC Instance
  * @retval None
  */
__STATIC_INLINE void DDL_RTC_EnableIT_SEC(RTC_TypeDef *RTCx)
{
  SET_BIT(RTCx->CTRL, RTC_CTRL_SECIEN);
}

/**
  * @brief  Disable Second interrupt
  * @note   Bit is write-protected. @ref LL_RTC_DisableWriteProtection function should be called before
  * @param  RTCx RTC Instance
  * @retval None
  */
__STATIC_INLINE void DDL_RTC_DisableIT_SEC(RTC_TypeDef *RTCx)
{
  CLEAR_BIT(RTCx->CTRL, RTC_CTRL_SECIEN);
}

/**
  * @brief  Check if  Second interrupt is enabled or not
  * @param  RTCx RTC Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t DDL_RTC_IsEnabledIT_SEC(RTC_TypeDef *RTCx)
{
  return (READ_BIT(RTCx->CTRL, RTC_CTRL_SECIEN) == (RTC_CTRL_SECIEN));
}
#endif /* RTC_CTRL_SECIEN */

#if defined (RTC_CTRL_OVRIEN)
/**
  * @brief  Enable OverFlow interrupt
  * @note   Bit is write-protected. @ref LL_RTC_DisableWriteProtection function should be called before.
  * @param  RTCx RTC Instance
  * @retval None
  */
__STATIC_INLINE void DDL_RTC_EnableIT_OW(RTC_TypeDef *RTCx)
{
  SET_BIT(RTCx->CTRL, RTC_CTRL_OVRIEN);
}

/**
  * @brief  Disable OverFlow interrupt
  * @note   Bit is write-protected. @ref LL_RTC_DisableWriteProtection function should be called before.
  * @param  RTCx RTC Instance
  * @retval None
  */
__STATIC_INLINE void DDL_RTC_DisableIT_OW(RTC_TypeDef *RTCx)
{
  CLEAR_BIT(RTCx->CTRL, RTC_CTRL_OVRIEN);
}

/**
  * @brief  Check if  OverFlow interrupt is enabled or not
  * @param  RTCx RTC Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t DDL_RTC_IsEnabledIT_OW(RTC_TypeDef *RTCx)
{
  return (READ_BIT(RTCx->CTRL, RTC_CTRL_OVRIEN) == (RTC_CTRL_OVRIEN));
}
#endif /* RTC_CTRL_OVRIEN */

#if defined (BAKPR)
/**
  * @brief  Enable Tamper  interrupt
  * @param  BAKPRx BAKPR Instance
  * @retval None
  */
__STATIC_INLINE void DDL_RTC_EnableIT_TAMP(BAKPR_TypeDef *BAKPRx)
{
  SET_BIT(BAKPRx->CSTS, BAKPR_CSTS_TPIEN);
}

/**
  * @brief  Disable Tamper  interrupt
  * @param  BAKPRx BAKPR Instance
  * @retval None
  */
__STATIC_INLINE void DDL_RTC_DisableIT_TAMP(BAKPR_TypeDef *BAKPRx)
{
  CLEAR_BIT(BAKPRx->CSTS, BAKPR_CSTS_TPIEN);
}

/**
  * @brief  Check if all the TAMPER interrupts are enabled or not
  * @param  BAKPRx BAKPR Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t DDL_RTC_IsEnabledIT_TAMP(BAKPR_TypeDef *BAKPRx)
{
  return (READ_BIT(BAKPRx->CSTS, BAKPR_CSTS_TPIEN) == BAKPR_CSTS_TPIEN);
}
#endif /* BAKPR */
/**
  * @}
  */

#if defined(USE_FULL_DDL_DRIVER)
/** @defgroup RTC_DDL_EF_Init Initialization and de-initialization functions
  * @{
  */

ErrorStatus DDL_RTC_DeInit(RTC_TypeDef *RTCx);
ErrorStatus DDL_RTC_Init(RTC_TypeDef *RTCx, DDL_RTC_InitTypeDef *RTC_InitStruct);
void        DDL_RTC_StructInit(DDL_RTC_InitTypeDef *RTC_InitStruct);
ErrorStatus DDL_RTC_TIME_Init(RTC_TypeDef *RTCx, uint32_t RTC_Format, DDL_RTC_TimeTypeDef *RTC_TimeStruct);
void        DDL_RTC_TIME_StructInit(DDL_RTC_TimeTypeDef *RTC_TimeStruct);
#if defined (RTC_CALENDAR_SUPPORT)
ErrorStatus DDL_RTC_DATE_Init(RTC_TypeDef *RTCx, uint32_t RTC_Format, DDL_RTC_DateTypeDef *RTC_DateStruct);
void        DDL_RTC_DATE_StructInit(DDL_RTC_DateTypeDef *RTC_DateStruct);
#endif /* RTC_CALENDAR_SUPPORT */
#if defined (RTC_ALARMA_SUPPORT)
ErrorStatus DDL_RTC_ALMA_Init(RTC_TypeDef *RTCx, uint32_t RTC_Format, DDL_RTC_AlarmTypeDef *RTC_AlarmStruct);
void        DDL_RTC_ALMA_StructInit(DDL_RTC_AlarmTypeDef *RTC_AlarmStruct);
#endif /* RTC_ALARMA_SUPPORT */
#if defined (RTC_ALARMB_SUPPORT)
ErrorStatus DDL_RTC_ALMB_Init(RTC_TypeDef *RTCx, uint32_t RTC_Format, DDL_RTC_AlarmTypeDef *RTC_AlarmStruct);
void        DDL_RTC_ALMB_StructInit(DDL_RTC_AlarmTypeDef *RTC_AlarmStruct);
#endif /* RTC_ALARMB_SUPPORT */
#if defined (RTC_ALARM_SUPPORT)
ErrorStatus DDL_RTC_ALARM_Init(RTC_TypeDef *RTCx, uint32_t RTC_Format, DDL_RTC_AlarmTypeDef *RTC_AlarmStruct);
void        DDL_RTC_ALARM_StructInit(DDL_RTC_AlarmTypeDef *RTC_AlarmStruct);
#endif /* RTC_ALARMA_SUPPORT */
#if defined (RTC_COUNT_SUPPORT)
ErrorStatus DDL_RTC_TIME_SetCounter(RTC_TypeDef *RTCx, uint32_t TimeCounter);
ErrorStatus DDL_RTC_ALARM_SetCounter(RTC_TypeDef *RTCx, uint32_t AlarmCounter);
#endif /* RTC_COUNT_SUPPORT */
ErrorStatus DDL_RTC_EnterInitMode(RTC_TypeDef *RTCx);
ErrorStatus DDL_RTC_ExitInitMode(RTC_TypeDef *RTCx);
ErrorStatus DDL_RTC_WaitForSynchro(RTC_TypeDef *RTCx);

/**
  * @}
  */
#endif /* USE_FULL_DDL_DRIVER */

/**
  * @}
  */

/**
  * @}
  */

#endif /* defined(RTC) */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* APM32F4xx_DDL_RTC_H */
